{"pages":[{"title":"很抱歉但我把这里的内容都删掉了","text":"从头再来吧抱歉","link":"/about/index.html"},{"title":"标签","text":"","link":"/tags/index.html"},{"title":"分类","text":"","link":"/categories/index.html"},{"title":"友链申请","text":"如果您也有自己的个人博客，并且愿意互换友链，可先在贵站添加我的站点，然后再在下方留言。 审核之后，贵站的信息就会被放在左侧了‍:P 本站信息： 名称：HackerRouter’s Blog 描述：往者不可谏，来者犹可追。 链接：https://hackerrouter.xyz/ 头像链接：https://hackerrouter.xyz/images/avatar.png 友链申请格式 名称： 链接： 欢迎交换友链 OAO","link":"/application/index.html"}],"posts":[{"title":"关于failed to create a child event loop报错的解决方法","text":"（没错，我这个憨批已经被雷某加速器整的网络设置坑了两次了） 前不久，开MC时进入服务器时，显示java.lang.IllegalStateException: failed to create a child event loop 有时会显示java.lang.nullpointerexception:group，后台报错则提到java.lang.nullpointerexception:group 并且在服务器列表里显示无法连接至所有服务器（可恶，这MC，不玩也罢 下面放出报错及连接画面： 起先翻了一圈百度，发现了以下几种解决方法： 1.关闭防火墙并添加例外应用； 2.关闭代理； 3.还原hosts文件。 我试着关闭防火墙，并不出乎意料的是：毫无卵用 接着又尝试关闭代理，但关闭了个寂寞，还原hosts文件后还是没用 我于是激动地跑去mcbbs上发了个问答帖，由于当时过于激动悬赏就设了500金粒（呜呜我的金粒 在此之前，我因死活登不上steam社区（想登上的原因是为了搞facerig）改了hosts文件又用了雷某加速器 当然，结果还是登不上 我就死心了跑去开mc准备消遣会，结果出现了本文开头的场面 正当我灰心丧气准备放弃一切放弃自我时 我在mcbbs的帖子被一位大佬回复了，其原话如下： “所给信息不太足够，无法直接的断定出具体问题所在。不过根据 java.lang.IllegalStateException: failed to create a child event loop 这条错误很有可能是网络问题。先将 host 文件恢复原样，使用 127.0.0.1:25565 来尝试链接一下。如果无法链接上则再尝试关闭防火墙，修复 LSP，重置部分网络设置等等，建议可以搞个“软媒魔方”里面的网络修复或者火绒中的“断网修复”功能，可以试试，实在不行也可以试试 360 的断网急救箱，虽然可能要装一次 360，但是很有可能可以解决问题。一般情况下采用以上方法应该能解决绝大部分问题。” 我当时便采取了这位大佬的建议 最后我这个憨批装了个360重置了所有网络配置 重启电脑后，我又能上MC了 好耶! 下面放个在BCP的摸鱼照 最后的总结：不要用雷某加速器加速steam了，用一次废一次","link":"/2020/10/11/about-failed-to-create-a-child-event-error/"},{"title":"半退网声明","text":"说实话,我也很疑惑我为什么要在此时写这篇文章,但很显然,解释完所有的事情或说写完这篇文章就能使我的内心得到许多的慰籍,毕竟,愧疚这种事物还是得直面它才能感到轻松很难想象我真正快乐,真正放松时是什么时候了 但我依稀记得是2017年的暑假,我用自定义NPC mod做完一张rpg地图时,那种快乐,那种自豪,那种终于做到自己一直以来想要达成目标时的兴奋其实那张地图做得一般,由于没搞定出生点问题,甚至还需要玩家从出生点外翻进可游玩区域,且由于重生点也在外围处,使得很多满级大佬时不时对新人很”友好”,然后mod有时候会出bug吞npc交易,于是我只得一遍遍地复制回商人。最后的boss做得很烂,基本上卡视角就能放风筝打死。可即便是如此,我叫上我的朋友,在wy随便开个房间,依然玩的很尽兴18年,我终于入正,也学习到了关于加速器的许多知识,于是那年暑假,我输入hypixel地址,与朋友们极其愉快地玩着小游戏,直到现在我都还记得有一次组团玩动物躲猫猫时我卡墙角怂到最后10秒时,跑出来放烟花然后一堆人追我的情景。有的时候真的很想回到过去,尽管我当时mc的内容都不精(哦不,现在好像还是都不精),但至少有一群志同道合的朋友,愿意和我玩些在现在来看不可理喻且毫无逻辑而幼稚的游戏19年,我入了PVP圈,当然,由于沾染上了辅助mod和黑卡生意,最后落到了非常不好的地步,可以拿来当反面教材那种。在这里向我曾经伤害过的陌生人和朋友道歉,不知道你们还能否看见,我知道,我是个很糟糕的人,但我恳求你们饶恕我和我所犯下的一切过错,真的,我真心地请求你们原谅,对不起,我做了很多糟糕的事情,做了很多荒唐的决定,我不该影响你们的游戏体验,也不应该凭一己之论就乱封人，我错了,我真的真的很抱歉,求求你们原谅我于是网暴来了,虽然起因并不是PVP圈的事情,但它给了年少无知又骄傲自大的我当头一棒,我开始反思自己犯下的一切过错,可笑的是,我只是一味地想掩盖真相,一直自我催眠，说这不是我的错。可它当然就是我的错,一直是我的错,一直是我自大的行为造成的这里向那位起头网暴我的老哥道歉,我不该随便拿你的号看视频,很抱歉当时我并不知道这个号是有人用的,也没有把你的警告当回事。现在我真心实意地请求你的原谅,虽然我知道此刻在看这段文字的你可能会更加怒火中烧。对,已经好几年了,我却连个像样的道歉都没说。真心希望您能原谅过去的我一时冲动犯下的天理难容之错,虽然我明白你不会原谅,但将这些话说出口,至少我内心的愧疚会少那么一点。这件事过去好几个月后,我也从自我催眠中清醒了过来,并尝试做一些新的作品视频质量仍是一如既往的差,甚至剪也不剪,直接丢b站上我曾想做一个略微含meta元素的mc地图,类似于叙事类的那种,用着我少得可怜的命令方块和红石的知识（当时还没学过红石）,最后只做了个开头,逻辑就是让玩家选不同选项触发不同对话走不同线,内容则是一个NPC问玩家从哪来的叫什么你们能想象一些判定都是怎么做的吗?直接用比较器然后接命令方块放置指定位置红石块激活其他命令方块然后清除掉红石块,听上去很复杂麻烦对吧?然后我就自然而然放弃了制作。带有选项的文字则是我通过一个网站生成的,但是我现在把网址丢了,那个网站是真的好用,还可以生成各种自定义nbt物体接着是海草舞火的时候,我想做一个盔甲架舞,找了个实时编辑盔甲架动作的软件,然后又放弃了再接着我了解到了just do it的梗,我想做一个mc动画,于是乎我学了mine-imator和cinema 4d,然后学到一半又放弃了瞧,拖延症就是这个时候开始一步步折磨我的,它让我想象力泛滥,让我时时刻刻有着新的点子,新的想法,并把它们记到一个隐形的to do list上，带来了令人窒息的焦虑,到最后是麻木,而麻木造就了我的拖延我逐渐变成了一个与Coda(详见游戏《新手指南》)完全相反的人,他是历经许多困难才能得到点子,然后加以实现,而我却控制不住我的灵感,随时都能啪地一下冒出新奇的想法,面对着能绕地球一圈的待办事项喘不过气,没有任何动力去实现,去达成我的目标很显然，这是拖延症的一种形式的呈现，但我当初的阅历还不足以让我认识到这一点我一直在无形中强迫着我想出更多的想法,却逐渐丧失掉了行动能力,彻底忘掉了初心我只是把我塑造成了一个只会输出不同奇奇怪怪的公式的机器,却没有任何算力能让我进行输出内容的模拟我如同一个把钥匙扔出房外将自己锁在自己幻想中的人一样,我渴望有人能给予我饶恕,洗刷我的罪孽，殊不知我自己才能解放自己梦做多了,便分不清虚实我有一点点后悔了然后我创造了我的服务器然后我又后悔了我发现我根本没有时间与精力去支持我管理服务器我一直是个不敢承担责任的人我想改变所以我写了这篇扪心自问的文章所以我还是在逃避我的成绩烂到不行了我却不敢面对是的,我是个coward所以我思来想去,决定将to do list缩减到两条一是学习二是我的新游戏,但是是一个切实能制作的游戏,只需要python基础和一点英语知识就能写的游戏，所以不用担心长时间不接触编程就不会写了所以,这也意味着我大概要半退网了抱歉,朋友们但我真的不想再承受那种焦虑了,还有力不能及带来的抑郁我只能暂时删掉待办事项单上的其他项目抱歉,真的,很抱歉我的确是个糟糕的人没有能力却还要东想西想说大话的人比婴儿游戏(详见游戏《史丹利的寓言》)里的那个婴儿要更糟糕还会输出一箩筐负面思想的人放弃按按钮不再拯救我让我在火中焚烧是个非常正确的决定我从来就不是个技术党一直不是只是个假装自己懂很多但啥也不精的人只是个沉浸在幻想的泡沫中的人甚至由于这两点入其他圈子再也找不到新的朋友了对不起,可能我这篇文章哪里用词不对,我现在不太能控制我的情绪,我的语言表达能力也很糟,这也是我为什么痛恨开麦的原因,念自己写的稿子都要练习半天,我真的,真的,很讨厌在现实中交流,并且确实有轻微社交障碍,我不否认,但不太影响我写文章,相反,我感觉写文章比现实中的聊天简单多了在你认识到我是多么一个失败的人和不值得交往的人后现在,取关吧,退服吧,删好友吧我不介意你这么做我只想静一静想想以后的路要怎么走在认识到我是个糟糕的人后。我也该思考如何改变了所以,暂时再见吧,各位感谢你读完了我的文章明年暑假,我会彻底回来的(后记:写的时候心情不好，有点偏题,敬请谅解)(又及:原本不想发表这篇文章的,但我得尊重昨天的我的意见)","link":"/2021/10/25/resignation/"}],"tags":[],"categories":[]}