{"pages":[{"title":"关于","text":"·HackerRouter (Lúcio) : Hello!·HackerRouter (Lúcio) : Hey there!·HackerRouter (Lúcio) : Greetings!·HackerRouter (Lúcio) : Hello there!·HackerRouter (Lúcio) : Hello hello!·Too many messages! Please wait a few seconds… 你好，这里是HackerRouter，一个只会中文和英文的憨憨欢迎来到本人的博客本博客初次加载速度较慢，毕竟托管在Github Pages上，还请各位谅解。若您经常要浏览本博客，请勿清空浏览器缓存&gt;=) 本博客并非技术性博客，规模（等等能用这个词形容吗）较小，更新速度不快。最早建于2019年，仅仅是脑袋一热，就跟风在度娘上翻教程整了这个博客，最开始写的文章均已丢失，现在也没有印象了，总之都很水，丢了也无所谓。当时选择的是Hexo + icarus风格，评论区则使用了Valine，沿用至今（不得不说icarus风格是真的好康，极其简洁，最新版本不需魔改就能支持Valine，强烈推荐） 一般来说博客会更新些个人感兴趣的事物。目前因个人原因不会更新太多有技术含量的文章，对此我也很无奈=/ 目前博客可通过hackerrouter.xyz及hackerrouter.github.io访问（没错终于买域名了，Dynadot yes） 再来谈谈我自己吧 BCP服主，B站 百万大 UP主，中学生党，非技术党。老鸽子一只，憨批一个，LGBTQIA成员，Suicide Forum常驻成员 疑似MDD及BPD患者，但还没有到看心理医生的地步。而且我也拒绝去看 口语表达能力不行，中英皆同，informal和formal文字总会用在相反场景，故通常不开麦，只打字 什么都会，什么又都不精（什么都会，但不完全会），有创造力，但无创造的动力 目前为学习戒了MC，退了生电圈，咕了Github项目，推了视频更新，放弃了继续搞编程，拒绝了对于Arduino的深研。总之，”我热爱学习！”（震声） 其实主要还是家长不支持我现在搞编程，对此我也没办法，活在一个复古的家庭，很难受。而且我也不是神，不会A4纸编程。 兴趣爱好目前仅有打OW，看OWL（支持上海龙之队和成都猎人队，整了俩联赛皮肤），打MC，研究赛博朋克文学，听歌，Rap等。追武侍乐队及姆爷，喜欢听些节奏感强的歌，或者慢歌丧歌 强烈推荐本人的网易云音乐歌单：4974032115 不看番不追番不打碟不玩音游不接触二次元，活跃在OW美服，竞技分2500+（延迟高了没办法，英语不好也不太能交流，想找个上分队都需要麦，吐了，队友要么是秀儿要么不给资源要么狂送），只为找个好心人士学英语。战网Tag为：RichardNight#3764 欢迎添加好友。","link":"/about/index.html"},{"title":"标签","text":"","link":"/tags/index.html"},{"title":"分类","text":"","link":"/categories/index.html"},{"title":"友链申请","text":"如果您也有自己的个人博客，并且愿意互换友链，可先在贵站添加我的站点，然后再在下方留言。 审核之后，贵站的信息就会被放在左侧了‍:P 本站信息： 名称：HackerRouter’s Blog 描述：往者不可谏，来者犹可追。 链接：https://hackerrouter.xyz/ 头像链接：https://hackerrouter.xyz/images/avatar.png 友链申请格式 名称： 链接： 欢迎交换友链 OAO","link":"/application/index.html"}],"posts":[{"title":"关于failed to create a child event loop报错的解决方法","text":"（没错，我这个憨批已经被雷某加速器整的网络设置坑了两次了） 前不久，开MC时进入服务器时，显示java.lang.IllegalStateException: failed to create a child event loop 有时会显示java.lang.nullpointerexception:group，后台报错则提到java.lang.nullpointerexception:group 并且在服务器列表里显示无法连接至所有服务器（可恶，这MC，不玩也罢 下面放出报错及连接画面： 起先翻了一圈百度，发现了以下几种解决方法： 1.关闭防火墙并添加例外应用； 2.关闭代理； 3.还原hosts文件。 我试着关闭防火墙，并不出乎意料的是：毫无卵用 接着又尝试关闭代理，但关闭了个寂寞，还原hosts文件后还是没用 我于是激动地跑去mcbbs上发了个问答帖，由于当时过于激动悬赏就设了500金粒（呜呜我的金粒 在此之前，我因死活登不上steam社区（想登上的原因是为了搞facerig）改了hosts文件又用了雷某加速器 当然，结果还是登不上 我就死心了跑去开mc准备消遣会，结果出现了本文开头的场面 正当我灰心丧气准备放弃一切放弃自我时 我在mcbbs的帖子被一位大佬回复了，其原话如下： “所给信息不太足够，无法直接的断定出具体问题所在。不过根据 java.lang.IllegalStateException: failed to create a child event loop 这条错误很有可能是网络问题。先将 host 文件恢复原样，使用 127.0.0.1:25565 来尝试链接一下。如果无法链接上则再尝试关闭防火墙，修复 LSP，重置部分网络设置等等，建议可以搞个“软媒魔方”里面的网络修复或者火绒中的“断网修复”功能，可以试试，实在不行也可以试试 360 的断网急救箱，虽然可能要装一次 360，但是很有可能可以解决问题。一般情况下采用以上方法应该能解决绝大部分问题。” 我当时便采取了这位大佬的建议 最后我这个憨批装了个360重置了所有网络配置 重启电脑后，我又能上MC了 好耶! 下面放个在BCP的摸鱼照 最后的总结：不要用雷某加速器加速steam了，用一次废一次","link":"/2020/10/11/about-failed-to-create-a-child-event-error/"},{"title":"如何用CheatEngine在赛博朋克2077中获取无限的欧刀","text":"先咕一会 图找不到了","link":"/2021/01/09/how-to-get-infinite-%E2%82%AC$-in-cyberpunk2077-by-using-cheat-engine/"},{"title":"如何看待CNR事件","text":"“我一直觉得开创造用指令没什么的，只要是自己的服务器当然是自己说的算，但是你骗观众就不对了。”——XeKr“……千万不要一大帮粉丝过去私信口水大战，这种UP出言粉丝发动的事情，已是屡见不鲜了，希望各位都是文明人，不要过去怼别人……”——CarrotLee 先给各位还不知道的同志们科普一下吧，前不久，有一个叫CNR的服务器为了能火，不惜运用多种手段搬他人作品到服务器里且没有指明出原作者，厚颜无耻地在标签里写上生存，在标题里写上“肝硬化”（其实也挺肝的，辛辛苦苦作弊复制了那么多东西），宣传视频、澄清专栏里也破绽百出，例如悬空土楼，带框架且一模一样的刷冰机，蘑菇切口整齐，采矿机一模一样、空置域墙壁平整……5月10日时，CNR服注销官号删除文章和视频解散粉丝群后跑路了，留下了一堆无辜或是被隐瞒真相的玩家。 对于此事件，作为生电圈里的一位玩家，我是这么看的。首先，CNR服欺骗了观众——尤其是一部分非生电圈的玩家，还屡次删除质疑他们的人的弹幕或是评论，这点是非常肯定的。对于观众们给出的疑问，他们不但没有在那篇澄清文里给出令人信服的说法，反倒用旁人一眼就能看穿的谎言去弥补宣传视频里的种种漏洞。你自己开创造自己玩可以，说是满足自己的虚荣心也好，都无可厚非；但是欺骗观众这点是非常不可取的。其次，CNR服的“追随者”或是玩家也拼命洗白CNR，即使CNR服管理在被多人质疑后做出了禁止加粉丝群的心虚举措，他们依然“坚信”着CNR没有作弊（具体表现在所发的评论当中，是不是真的”坚信“就不知道了），这种行为令人作呕。 由于生电玩家只是少数，部分人能看穿，不代表其他玩家可以看穿，大部分玩家依然会觉得视频很nb于是把视频顶上去，所以我认为这依然需要生电玩家们找出决定性证据选择恰当的方式去锤（但不要盲目发动大量人私信轰炸，这种行为造成的负面影响会比较严重），让大部分玩家意识到他们被欺骗了，热度上去不是问题，这反而更能警醒其他人。 好像没有继续往下写的必要了，咕咕 CNR原宣传视频(贡献者：fubukipower）取件码：vts8r9","link":"/2020/05/11/how-to-regard-cnr/"},{"title":"【MCJE】1.14+区块加载机制讲解","text":"本文内容参考了CV4639814、CV3395631，只是简略地科普一下。如有疏漏，欢迎私信或在评论区里指出。1.14+时，每个被加载的区块都有一组有序且与之相关的”加载标签”。 “加载标签”包含”加载标签”的类型、加载等级及剩余存活时间 加载等级的范围为22-44，一般来讲，游戏里只会在22-33的范围里。等级越低，则加载的内容更多。 加载等级的类型共有四种，即强加载区块、弱加载区块、伪加载区块（或称边界）和不可访问区块。 强加载区块(ET, ENTITY_TICKING)：加载等级 ≤ 31，运行所有游戏特性，运算实体。 弱加载区块(TI, TICKING)：加载等级 = 32，运行所有游戏特性，除了运算实体。 伪加载区块(BD, BORDER)：加载等级 = 33，几乎不运行游戏特性，但那里的生物仍会占用刷怪上限。 不可访问区块：加载等级 ≥ 34，相当于未被加载。 若有一个区块的加载等级为30，则周围的情况会是下图： 深绿色部分：强加载区块，加载等级为30 绿色部分：强加载区块，加载等级为31 黄色部分：弱加载区块，加载等级为32 蓝色部分：伪加载区块，加载等级为33 灰色部分：不可访问区块，加载等级为34 当一个实体通过传送门后，对应维度的传送门周围的区块会被加载15秒。包含传送门在内的一个区块加载等级为30，周围一圈的区块加载等级则为31，以此类推，会得到上图同样的结果。 同时，当有两个相距不远的区块加载等级为30时，则可能出现以下这种情况： 我个人比较推荐的区块加载器是我弄的加载器，小巧而精悍，应该是目前为止全世界最小的两类加载器了： 运用这些区块加载器永久加载一片区块，在其弱加载或边界加载区块中存放大量怪物占满刷怪上限，就可以制作伪和平装置了。怪存的数量通常来讲为 玩家数量*70 。 1.14中，可以用刷怪笼占满刷怪上限。 1.15+时，需要用结构怪物（即随结构生成的怪物）、变成僵尸村民的村民或者凋灵占满刷怪上限。命名，持装备或物品的怪物不占用刷怪上限。 刷怪笼见AV74194010，凋零笼子见AV95075381，运用到僵尸村民的伪和平见AV89025160或AV89132545，运用到凋灵的世界最小凋灵伪和平（没错又是我做的）见AV286609773","link":"/2020/04/09/chunk-load/"},{"title":"公告","text":"本博客目前更新了icarus主题版本，使用了某风格，所以底下的评论文字颜色看起来可能有点反人类目前暂未找到解决方案","link":"/2021/01/28/notice/"},{"title":"为什么我又选择用GitHub搭建我的博客","text":"有了新域名后不想备案，就这么简单（Gitee是国内的……是的，你目前可以通过以下网址访问我的博客：https://hackerrouter.github.io/https://hackerrouter.xyz/http://hrouter.cr.cx/","link":"/2021/01/16/why-i-choose-github-to-build-my-blog%20-%20%E5%89%AF%E6%9C%AC/"},{"title":"为什么我选择用Gitee搭建我的博客","text":"没别的，一是方便，二是图片加载快。","link":"/2021/01/10/why-i-choose-gitee-to-build-my-blog/"},{"title":"EN原文 赛博朋克2077短篇小说：2AM - She Calls","text":"注:这篇小说由CD PROJEKT RED 编剧团队负责人 Tomasz Marchewka 执笔 2AM - SHE CALLS 2071 ADIn Night City, it’s the little things. Like this bang-up noodle shop in Kabuki. Little place called Nuan’s. Nuan mops up the counter grunge, then wipes her ladle with the same sad rag. As she spoons out your noodles, you think the filth should’ve stayed where it was. You also think the meat might be sewer rat, but if this is sewer rat, you could eat these noodles every night. Long as they came slathered in Nuan’s extra-hot. Little thing about cab driving – if I wanna eat, I switch off the combat comms, pick my spot, park… and eat. Love it. Triple-patty melt yesterday, baby back ribs today. Master of my fate. It’s a nice change of pace after the NCPD grind – there, you eat when you can grab a minute to yourself. After punching out your twelve hours, or on the job and on the run. Once you’re done with the gig for good, you grab any chance to eat like a civilized human being. Don’t take my word for it. Ask the ex-cons who do the same thingonce they’re out. I’m half-sitting on the hood of my Combat Cab, slurping down the last of Nuan’s noodles. My comms pings. The private one. I know the number. It’s one I never decline. I reach into the car through the open window and punch the connect to dispatch. One-two-three. EN ROUTE - VACANT – PICKING UP CLIENT The three messages flash quickly, blend into one. My empty noodle box lands in a greasy rustle on a heap of forty others in the can outside Nuan’s door. I don’t bother to check the address. Downtown. I always pick her up downtown. Half past midnight. Atypical. Too late to be getting off work, too early to be leaving a party. Usually calls around two. Did something happen? No, if something’d happened, she wouldn’t be calling me. Means like hers, she’d call the NCPD, Trauma Team, private studiocorp huscle or all three. Maybe she already did. Maybe I’m just another gonk in a whole fucking retinue of gonks tripping over each other to save the saucy dame in distress. I glance at the message again. Just the address. No sign, no signal, no cry for help. I gun it anyway. Just in case. Once downtown, I start looking for trouble. Old habit. And I’m good at it, usually spot trouble before it spots me – another parting gift from my time on the force. Except downtown, it’s not always so simple. Up in Kabuki, trouble flies out the biz end of a semi-automatic or caves your skull in with reinforced brassknuck implants. Downtown? Downtown trouble dons kid gloves. Maybe a starched white collar, too. No trouble on my way to the pickup. I pull to the curb at the address on my display. Some new place I don’t know. Floor-to-ceiling glass, the ceiling arriving around the fourth floor, where fussy chandeliers clash with the otherwise pervasive Japanese minimalism. I see a throng at the door, waiting to get in. A choom stands behind a thick reservation book. His head does nothing but nod, but he’s gotta be telling one would-be guest after another how terribly sorry he is… There she is. My fare. She gets in, slams the door. The meter flinches into action. PICKING UP CLIENT – EN ROUTE Ora Dominguez, or as the city knows her, Ora Di. Di as in deep. As in desire, delight… demise? Olive skin. Jet-black curly hair shooting out of her head like a fistful of razor wire. Good-looking, very, but no model – more like the hottest girl on the block. Deep, raspy voice. The slightest accent, a whiff. Hazel-brown eyes that reviewers like to dismiss as “boring” but that Ora stubbornly refuses to swap out for implants. In the braindance world, she’s a type – a “gangerchick.” “Hey, Frank. Glad to see you.” She lights a cigarette. “Let’s go home.” “Which one?” “The real one.” Vista del Rey it is. We drive. I gently adjust the rear cam so it shows less road, more Ora. The cam feeds to a monitor a little left of and under the wheel, keeping my view hidden from hers. Leather jacket, ripped jeans, knees exposed – La Catrina grins out of the left tear. Leather spike heels, too. Ora’s smoking like it’s going out of style. More pissed than stressed, I think. “Shit party?” I offer, courteous as always. Maybe a chat will calm her down. Her, me, either of us, both? “Little early to be headed home.” “Shit date. Blind,” she replies, trying to be nice. Can’t be sure if it’s for me or if it’s the braindance biz poking through. “Ever been on one?” “Not my style.” She grins. “Wasn’t even a real date. Media ploy. You know, studio sets you up with someone you might scroll with. To see if it ‘sticks,’ if people see us out together and like it so much they just gotta talk about it… You go to some hip new spot, have a drink, sit there bored while pretending not to be. Ideally, you sit where the paparazzi can see you. And if it sticks? You make pagetwo, maybe three in a normsheet, page one of the screamers.” She ends her sentence with her smoke. Before it dies, she lights another and tosses the glowing butt out the window. Stress it is. I sense there’s more to the story. Can’t remember a time she was ever this worked up about, well, work. “Tellin’ ya, Frank. Grab one of the screamsheets tomorrow, first thing. If you see Zane Magnum made a gangerchick swoon, that means I stand to make some serious scratch. Fuck.” She never liked braindance. Said once that she might as well be pushing boosters down on the corner, but, wouldn’t ya know it, scrolling braindance pays better. I see Ora start to fidget on the monitor. The smokes aren’t helping. “Choom not your type?” “Not really.” Another smile cuts across her face, different now. Sincere. “Too short?” I venture. “Too tall?” “Let’s just say I think a man’s ink should mean something.” We drive in silence for a moment. This time of night, traffic’s down to a trickle, giving us about fifteen minutes to Vista. Eight and a half months I’ve been driving her, now. Started right after her first big production. A little romdrama about a down-home ‘Tino girl and a 6th Street macho with big corpolawyer dreams. Romeo and Juliet – recycled, repackaged and regurgitated in Heywood. But hey, it “stuck.” Nobody remembers Guy Whatsisname. Everybody remembers the first time they felt what it was like to come up in the streets. When they needed a ganger before, they grabbed an actor. Usually some affected, tattoo-stained ass who over-snorted and could barely manage to grunt out an “ese” on cue. Ora knew Vista, the old Vista. Not the nice, respectable, tame del Rey of today. First time she got mugged, she was eleven. She had a knife. The poor bastard who tried her patience got a hole in his liver and a trip to the ER. For parental figures, she had a lonely deadweight father who could barely take care of himself, let alone a budding teenager. Her mother – still sitting out the rest of her third sentence. Might get out one day, might not. Girls like Ora don’t usually land in a gang. They wind up the playthings of tough streetmachos or they wind up dead. Me, I never relived any of her BDs. I don’t have to. I know what I’d feel if I became her for a moment. Something like the will to survive. Gangerchick. It stuck. The studio gave her a pad downtown, and she might have even spent a few hours there. In the end, though, she’d insist on going back to her old haunt. Realizing they couldn’t win, the studio tried to give her a private limo. One of those sleek, fancy caskets, an AI at its helm. Ora preferred to call a Combat Cab. Ora preferred to call me. First time around, it was dumb, blind chance. She called twice and I happened to get the call both times. Right around 2 AM, my hour. After the second happy coincidence, she just grabbed my direct line. “Think of it this way,” I start, breaking the silence. “You had a nice dinner on the studio’s dime.” “You would,” she snorts. “A full belly and Frank’s happy.” “You know me well,” I reply, smiling – woman’s not wrong. “Food was terrible. ‘Sides, I don’t really do Asian.” “You say that, but… I know a place that’d change your mind. Great noodles. I mean, that’s all they do – noodles.” She flashes me one of those smiles that got her where she is today. A smile with that special something. It grabs your eye and won’t let go. I’m sure she doesn’t see it. Ora thinks the studio pays her to be “exotic.” “Maybe you’ll take me there sometime,” she adds. Even though I know she’s teasing, I let myself believe it. I could see her sitting there, swinging her tattooed legs at Nuan’s disgusting greasecounter. Shit, she might’ve even liked it. “Uh-uh-uh – doubt your input would be happy about that,” I tease right back. “Heard he’s the jealous type.” “Emilio? He’s a teddy bear.” She actually believes that. “Huh. Where I’m from, teddy bears don’t do six in the can for armed robbery and aggravated assault.” “Prolly know smarter teddies than I do.” “Probably.” I can’t help but smile again. “What’s good with him?” I glance at Ora and the polite, good-natured mask falls away. Hm, seems she did learn something about acting while scrolling. Now she’s the angry, in-your-face firecracker, her frayed nerves on her torn leather sleeve. I remember Emilio from the old days – him and his crew. They were POIs for me ‘cause I was Organized Crime. All the boys in blue used to say they’d be the Valentinos to watch in a few years. He and Ora were an item even then. A few years down the road and she’s a star. I don’t know what’s up with Emilio. I don’t run around chasing goons like him anymore. I just drive his girl to and from their place in Vista del Rey. “Been dealing with some shit,” Ora finally answers, candid despite knowing I used to be police. Maybe she trusts me. Maybe I just popped the question the very second she stopped giving a fuck. “You know how it is.” “I know.” I notice Ora’s face. Might’ve finally dawned on her how well I do, in fact, know. “He’s stubborn, Frank. Keep tellin’ him he’s gotta think about the future. About where we’ll be in a year or… three. Like I am,” she sighs. “But he thinks things are the same as when he got out.” My memory’s good. I remember the shit Emilio’s crew pulled back in the day. They rose up quick, made big, fast eddies jumping corpo convoys, hitting up chop shops. Those bastards would sell the chooms’ own merch back to them for half the going price. They feared nobody. Crazy times. Good times. “You’d rather see him turn upstanding Night citizen? Get a real job, move out of Vista? Not like you don’t have the cash.” By you I mean them both. “Psh, Emilio holdin’ down a 9-to-5? No way, not our way.” All of a sudden, her streetsong comes rushing back, the syncopated rat-tat-tat you could barely catch when she first walked out of the club, the rhythm that ricochets off every corner in Heywood. “Peeps like us don’t just fuck off outta Vista.” “People like you, Ora? I mean, you seem to be holding down a real gig just fine. A good gig. I’d say it’s in the realm of the possible.” “Me…?” she grimaces. “Please. I ain’t no actor. In it for the scratch, holmes. Be real. All this right here? Born yesterday, be dead tomorrow.” “So, a five year plan and then back to Vista?” “Back? Wanna go back somewhere, you gotta leave first.” We pull up at the spot. Ora gives two short raps on the bulletproof divider, then slides out like a sigh and closes the door. On the screen I see her open the gate, walk through the front yard and vanish into a squat little duplex. Not too many of those left in Vista, and the ones that are still standing aren’t there by some happy coincidence. Anyone tried to demolish them, they’d get demolished themselves. VACANT. I drive to my next pickup. THE NEXT DAYWatson. I hate Watson. Whole district’s bad luck. I knew it, too. Had a realgut-punch feeling I should’ve hit DECLINE. I glance at the pickup monitoragain: Northside Industrial District, Watson.“473 here,” I sigh into the dispatch comms. “On my way.”PICKING UP CLIENTSee that right there? That’s my whole problem. Stubborn, refuse tolearn from my mistakes.Had the good fortune to be in the area after dropping off a fare in Kabuki.Kabuki’s technically Wats. Technically. The Tygers do what they can to holdthe place together. Tygers you can talk to. Maelstrom not so much. AndNorthside’s their haunt.After years in the Fifth, I still see the city from above, spread outbelow me in neat, slightly creased, color-coded pieces. Fifth Division,Organized Crime, the Gangbusters – depends who you ask. To us, Northsidewas always the ruddy brown of the Maelstrom freaks.I drive along without too much trouble. Not like you’ll be driving downthe street and suddenly someone’s semi-automatic starts spraying outtheir window at you. Wouldn’t rule it out, but usually when they shoot, youprobably gave ‘em a good reason to. My brain knows it, but I still keep aneye out for the red dots of laser sights. Watson. I hate Watson. I drive upto the pickup point and keep the engine running.Guy runs out, I can’t say from where. He flies over to the car, fumbleswith the handle, falls in head first. The yellow-framed PICKING UP CLIENTjumps to EN ROUTE – the meter flashes green, the numbers start their songand dance.“Fuck, man, fucking drive!” he shouts, lying flat on the back seat, stayingout of sight. Great. “The fuck you waitin’ for?! Foot, gas, now!”I drive, pick up speed, brace for a sudden, sharp turn.We’ve gone maybe twenty feet when the street bursts into flames. Abang, a flash, but no sound of cracking glass. Good. Still, shit’s bright and hotas Satan’s barf after a bender. Incendiary grenades, not Molotovs. Great.My jumpy, backseat-driving choom apparently pissed off some well-armedfreaks. I yank the parking brake and turn on a dime. The engine screams,the tires screech. Gunshots.Semi-automatic. Medium caliber.I catch sight of ‘em. Maelstrom – two goons and one chick, off tothe left. They’ve staked out the corner and are busy emptying theirmagazines into us – fast. Two hold rifles, but that’s about all they know, somost of the bullets fly over the roof. Maybe a few bounce off the armoredbody or bulletproof windows. Nothing the cab can’t handle. It’s coveringfire for the third gangoon, who…Fuck.The third jackboot thug kneels to set up a rocket launcher. Amotherfucking surface-to-surface rocket launcher. Fifty-fifty chance saidrocket is homing. These odds I do not like.Foot off the gas, I slam on the brakes. The car lurches, practically stopsin place. My passenger slams into the glass that separates us. It’s bulletproof, his smashed nose leaves a red splatter like a bug. I duck down, reachunder the seat. The Maelstromers might be shooting blind, but their bulletsare starting to hit home. They clink, they ricochet, let’s hope it stays thatway till…Hello, friend. M-76e Omaha – my saving grace in many a tight spot.I drop the window, lift my gun and see the jackass wrapping up. Heheaves the launcher onto his shoulder, sets his eye to the laser sight. I gottwo seconds, tops. I pull the trigger.Where his head was – a cloudburst of blood. In the mirror, I see theother two stop what they’re doing to rubberneck at what remains of him.Probably panic-wondering if he managed to press the big red button beforehis skull went ka-putt, if they won’t be vanishing into a crater any millisecnow.I hit the gas.A hard right and I hope we’re out of range. I speed up.Intersection, light’s red, we pull up. I take a moment to put my Omahaback where it belongs and steal a peek at my fare on the mon. Face gaunt,sallow skin stretched tight across sharp cheekbones. Sunken eyes –unnaturally jittery, unnaturally bright, unnaturally dilated pupils. Boosters,and not the cheap kind.“Where to?” I ask, figuring he’s had time enough to find his voice. I figuredwrong – he only grimaces, as if he misheard or I was speaking Dutch orsomethin’. Maybe he can’t breathe. “Dispatch just gave me the pickup.”“Just get me outta Wats,” he finally croaks. “You go to Pacifica?”Ah, looking to go far. Where Maelstrom fears to tread.“At this rate?” I gesture at the meter, already rounding off a nice coupleof hunnies, “I go wherever you want.”We leave Wats through Kabuki to avoid the downtown traffic. ‘Sides,Westbrook’s a better place to drop any tail we might have picked up.“Hmm…” he wonders for a second, and I can feel his eyes on me in themirror. “Make it Rancho Coronado. Show you where.”All right. Trip might be worth it after all, considering. Especially sincethis choom’s a man of few words. I like the quiet kind – they’re my secondfavorite kind of fare. My absolute favorites are the ones who never opentheir mouths, not even to breathe.“Where you learn to shoot like that?” There it is. Guess there’ll be chit--chat after all. “In the war?”“No.” We drive along silently for a few seconds. Fingers crossed it staysthat way.“On the street?”Stubborn, this guy.“Could say that.”“Don’t look like no ganger. What colors you fly, choom?”This is gonna be good.“Blue. NCPD,” I reply and glance at his face. Looks like he just satbare-ass in a bucket of ice. Choom’s cojones couldn’t shrivel up and hidefast enough. “Protect and serve, kid.”“What, was you in Psychosquad?” he asks, in the same awestruck toneI’ve heard a thousand times before. You tell five people you were in theNCPD, four of them will ask if you were with MaxTac. “Shit, no wonder youcan shoot.”“Organized Crime.”He shuts up again. Probably wondering if I caught the gang ink on hisneck, if I got any pals I still keep in touch with back at HQ. We’ll have our spellof silence after all.“Listen…” Wow, doesn’t give up, this guy. “Say I wanted you around forthe rest of the week? I mean, I got places to go, chooms to see…”.Oh, believe me, I know. Not five minutes ago a pack of rabid gangoonswere out to kill him, and one of them caught a dumdum between the eyes.That one’s on my fare, not me. Just the way it works, makes everyone’slives easier. Maelstrom knows it wasn’t personal on my part, it’s just thejob. Someone paid me good eddies to get him out of there. The real troublewaits for the hand that feeds the cred.“How much you take for a gig like that?” he asks.“Not my biz.”“Not your biz?” Can’t tell if he’s disappointed or offended. “Hell was thatback there?”“You scan my door?”Gives me another look like he forgot how words work. But his booster--addled brain puts it together eventually.“Yeah. Combat Cab.”“Exactly. I’m no huscle for rent, I’m a driver.”“What’s the difference?”Jesus H. Merciful Christ.“I’ll give you a hypothetical. Say a couple of crews, Tygers andMaelstrom, bump into each other. They ain’t the best of chooms.”“True…”“They meet on neutral turf, say a parking lot. And there’s a car there. Andit just so happens, because it always just so happens, that you’re huggingyour knees in the trunk of that car.”“OK…”“You give us a call, order a ride. I arrive and pop you outta that trunk, dropyou wherever you wanna go. So long as you’re in my cab, you’re my client.”“And if I get out?”“You let go of the handle, you let go of the handle. Simple as that.”Finally, mercifully, he nods and shuts up for good. We’re almost there. Ifire up the cred terminal, he pays and gets out. Christ. Motherfucker didn’tleave a tip. No wonder the USA collapsed. One AM, mid week – our hour. Me and the boys. We meet up at Tom’s. Small,old-school diner, nestled uncomfortably amid a clump of dark Heywoodhighrises. The interior smells of 24-hour fried eggs and bacon, barbecueribs and endless refills of cinnamon-laced drip coffee. One AM, mid week –quite the time to be at Tom’s. Some diners are finishing their day, some’resteadying themselves for a long night. Still others never seem to leave thestreet, lit up 24/7 like Tom’s sign. Trauma Team unit in the corner, hunchedover their plates. Even helmets off, they’re four clones in identical greenuniforms. Four identical orders, number two specials, scrambled. In myexperience, TTs are mostly decent people. Their gear might be high-end,but they make shit eddies plowing the hard plot of, you know, saving humanlives. Lives rich enough to afford a TT policy, but still… Their eggs could bedinner or breakfast. At the next table over, two joytoys, streetwalkers.Faces aged beyond their years, hair standing stiff with hairspray, bodiesskin-and-bones from eating one solid meal a week, tops. The deep holesin their forearms – either dug out with needles or scarred reminders ofimplants sold long ago. As I pass their table, one raises her head, fixes hereyes on me, her pupils flashing a looped Capitan Caliente ad. No scratch fora ripper? No problem – become a walking, talking scop commercial. Acrossthe dining room, the NCPD booth: two long, pigs-only benches. Two heads sitdrinking beer, too young for us to know each other. So much the better – it’sbeen over five years since I set down my badge. I’d rather it stayed down.I pass Crystal, the would-be pin-up waitress with two young mouths tofeed and a smile far too warm for Night City climes. I reach our booth. I’mlast to arrive; Goldknuckle Bob, Stokes and Pedro are already there. Onlyone missing from the regular crew is Travis, but that’s nothing unusual.Trav comes and goes as he pleases. Weirdo.Stokes scooches to make room for me. Pedro grumbles something intohis half-empty beer. Goldknuckle lifts his coffee mug in greeting, his eyesglued to the TV hanging over our heads.The TV’s why we chose this booth a few months ago – Goldknuckleneeds his news fix. Tried asking him why – just for laughs? Or is he abeliever? Could also be a cynic who can’t wait to hear the next lie. Askedhim a few times, never once got an answer.Crystal takes my order. The usual number four, over-easy, extra egg,extra bacon, rye bread – toasted dry. And coffee… lots of coffee. My night’sjust getting under way.“Fuck it all to hell,” Pedro grumbles, nursing what remains of his beer.“High time we got outta the biz, boys, I’m tellin’ ya. My numbers line up right,I’m gettin’ the fuck out. For real.”Here we go. Pedro’s been waiting for his numbers to line up since thedawn of time. Lucky numbers, lucky bet… his mind drools over the prospect.Soon as his ship comes in, he’s out. For real. Pedro’s been driving thelongest out of all of us. Probably never held down another job. Taxi driver byvocation, so busy taking fares he forgot to set anything aside to retire on.For me, Bob and Stokes… a temporary gig that’s gone a little longer thanplanned. Like, say, five years.“What’s it today?” I ask Stokes, knowing Pedro won’t give me thesatisfaction.“Delamain,” he mutters, tired of beating a dead drum. “Wheeling out anew personal combat mode.”“Easy to keep fares down when you don’t gotta eat, sleep or take a piss.”Pedro downs the rest of his beer, raises his empty glass and brows atCrystal. “Pretty soon, all we’ll have left to do is die.”“C’mon, they can’t touch us,” I reply. “Would Delamain run into a den ofgangoons to pay your ransom while you sit hogtied to a chair with a bagover your head?”“I wouldn’t either,” shrugs Pedro. “Why, would you?”“I did, once.”“Shit.”Crystal brings Pedro a fresh beer and his check. I grab it before shecan set it down.“You had a bad day, Pedro” I explain, seeing his face. “Could use a littleluck. Go grab yourself a winning ticket, champ.”Crystal smiles, takes the money. I give her a wink.The joytoys by the door get up and leave.“You heard? Car blew up in Japantown…” Stokes elbows me and raiseshis brows. “Think it was Tygers?”My stint in the NCPD apparently makes me a psychic. Like all you need is afew years in uniform to develop a supernatural sense for why trains, planesand automobiles spontaneously combust. You take the name of the districtwhere the bomb blew, the make and model, stir them into the grounds atthe bottom of your cup three times, et voilà.“Dunno,” I admit, “Maybe, maybe not.”“It’s not Tygers,” Bob pipes up from his corner. His gold-plated fingersdrum on the table as his hand takes on a life of its own. “It’s war, boys.”“You get that from Nighty-Night News at Nine?”“Nah, some old chooms.”Goldknuckle Bob. Says he used to do odd jobs, all sorts, even dabbledin corpo counterintel. It’s when he got the hand, apparently. These days,its fool’s gold plating is chipped and flaking… Huh, world’s most expensiveeczema. Bob can’t afford a new one. Makes a nice souvenir of the days whenhe wasn’t driving, though. Nobody believes a word he says.“Go on.”“Heard it’s the NUSA. Sticking its grubby fingers in the Night City cookiejar again. Myers is out secretly buyin’ up city politicos, draggin’ ‘em on boardthe Federalist train. She’s not naive enough to think the council’ll pass it,but just getting Night City to the table is huge. Now, our guys don’t give halfa shit one way or the other ‘cause the Japanese are paying ‘em better thanthe Feds ever could. And we all know what’s good at the top, right? Samething that’s good down bottom.”“I’ll drink to that,” Pedro clinks his mug on the table, then nods my way.“Thanks, Frank.”“Anyway,” Bob continues, “Apparently the FIA’s in town lookin’ for help,like, backup. Askin’ around, posting on BBSes, tryin’ to round up allies justin case. Skipping 6th Street for now, apparently. Last thing they need issome red-faced flag burritos megaphoning all over. Just lookin’ for nicequiet eyes an’ ears.”Huh. Probably the best, least credible horseshit I’ve ever heard fromBob. Either he’s improved his craft, or his mind is declining faster than wethought.“Uh-huh,” says Stokes, not smiling, but he’s more amused than ever, too.“They call you up?”“No. Wouldn’t tell you gonks if they did, anyway.” Bob’s dead serious. “Thisis war, gents. You talk, you get a pipe bomb taped to your fender.”I can’t hold it in anymore, burst out laughing, almost choke on my last bitof bacon. I reach for my coffee to rinse my throat and catch motion by thecop booth. Three plainclothes walk over, greet the two uniforms alreadyseated. I recognize one. Grizzled suit, Forties combover, old guard narc. Orat least I’m pretty sure.“Lookin’ a little chewed up, Frank,” Stokes says. Warm and fuzzy asalways; guy smokes like a tire fire but never his own cigs. I don’t knowwho taught him to bum smokes off people like that, but his talents arewasted behind the wheel. Should’ve been a traveling Eliyahu Bible salesman.Would’ve made a fortune and brought hundreds, nay, thousands into thefold. “Rough night?”“Night’s just gettin’ started,” I reply, downing the last of my coffee andwondering if I need another. Before I can decide, Crystal plods over and fillsmy mug. “Had a close call in Wats. One body, client walked.”“There’s that, at least…” Stokes starts fidgeting. “Listen, Frank, you gota smoke?”Unbelievable. Always asks me, knowing full well what my answer’ll be –I don’t smoke. But I pull out a practically untouched pack and set it on thetable.“Fished it outta the back seat,” I say, pushing it toward him. “Guess it’syour lucky day.”Me and Stokes are probably closest. Started driving around the sametime, him a few weeks before me. We became fast chooms. Stokes told meabout Nuan’s. Also gave me the coords for a couple car washes that’ll cleanbits of brain off your upholstery should trouble grow large and unwieldy.Has a wife and two kids. The wife drives, too, but we’ve never met.I glance at the news on the screen.”…a firefight broke out a few hours ago in Westbrook. NCPD officers onthe scene are calling it the latest chapter in the ongoing gang war betweenthe Valentinos and 6th Street. The conflict was thought to be all but over, yettoday’s events prove the past two weeks were only a temporary ceasefire.Clearly, the gangs have yet to bury the hatchet. This latest attack appearsto have been an ambush staged by one of the rival gangs.”Looks like a movie. Coroner’s people pushing bagged bodies around ongurneys. Cameraman even manages to catch one sad sack with an armdangling out of it. Cutaway to a closeup: Catrina tattoo prominent – thestuff of dreams…CUT (again) TO: EXTERIOR. WESTBROOK. Close on Tom Braddock’s tiredface. I remember him. Good guy. Out to clean up the city. Refused to acknowledge what the NCPD lacked – bodies, funding, gear and, above all, heart.Stubborn that way.”One bystander was killed in the fray. Ora Di, or rather, Ora Dominguez,a braindance star known to have had gang affiliations, was one of theindividuals gunned down earlier tonight. In her younger days, Dominguezbelonged to…”CUT TO: Braddock, still talking, but I can’t hear him.I raise my hand for the check. Crystal says something, not sure what. I pay, leave a tip, get up from thetable, all without thinking. My legs feel like warm scop jelly, but I think I canstand. Gotta run, I say, got somethin’ to take care of, somethin’ important.Now. A voice asks if I’m all right. Probably Stokes.I stumble toward the exit, a blind-drunk lunatic.Trauma Team’s gone.I open the door. I walk out.The two joytoys are on the corner, smoking. Leafy smoke – I smell it, myhead spins.The aroma conjures up her face, her getting in the cab that night. As thesmoke lifts, so does she. I lurch for the parking lot. Taxis standing all in arow like soldiers. One, two… third Combat Cab is mine.I get in.I take deep breaths – five. I squeeze my eyes open and shut – three. Thenred, I see red. Black spots on red.Everything grows darker.Five more breaths.Better.I fire up the engine, roll down the window, suck air and drive.The meter blinks red.UNAVAILABLE.I can’t think. I just drive. My hands on the wheel decide where. Pacifica,looks like, but I’m not going home. Bodybags. Tats. The perfect, lucky shotof the arm with ‘Tino ink. A man’s ink should mean something…It’s coming up on two AM. I glance at the comms, like every night. Almosttwo.Not tonight.This route I know well, but it’s taking me further from home. The night airslaps me in the face – hot, even through the window of a moving car. I speedup, don’t bother to look at the lights. Streets are empty. I breathe. I breathe. Once out of Heywood, I decide. Ramp for Westbrook. I pop open theglove compartment – CLICK. It’s full to bursting: crumpled burger boxes,telescopic baton, two old, half-empty packs of cigs, one brand they don’teven make anymore, went bust last year. There it is. Down at the bottom.I pull out a small transmitter, hook it in under the dash. NFC immediatelytunes the Combat Cab firmware to an NCPD frequency.”This is One-Adam-19. 10-7. Had enough for today.””10-69, Adam-19. You drive careful, now.””Got a 10-55 in North Oak. Says the chief’s a personal friend. Plate isNC42-223, need a 10-28.”Voices. Static. Voices. Static. And memories rush in. God, I loved thatgig… somethin’ about it. Probably the nights like this, when you hang aroundwaiting. I’m good at that. Probably why I’m a decent driver, too. Neverthought about it till now.Another voice breaks the static. This one’s familiar.”Five-King-13, coroner’s picked up the bodies from Charter Hill, stillongoing here.”That’s it. Charter Hill. On my way.King-13 is Brian Lee, Organized Crime. Kind of guy who wears suitsfor kicks, not just ‘cause the job demands it. Camera loves him. I might’veexpected they’d send Brian. Media’s likely on the scene, like locusts.Charter Hill, minutes later. On the lookout for flashing lights or corpomediavans. An AV hovers in the distance. Civilian, gotta be those N54 or WNShyenas getting their wide aerials. I know where to start.”Should I call your wife, warn her you might not be home tonight?”Olivia. Arroyo dispatcher. A ray of sunshine when you’re four hoursinto scraping a cyberpsycho off the asphalt ‘cause the MaxTac boys can’tbe bothered to clean up after themselves. Someone’s gotta collect theevidence.”Probably taking a lover as we speak. She can’t stand to see dinner goto waste.””I think I’d like to meet her sometime.””You’d get along. Duty calls, over and out.””Have a good night, now, King-13.”Smaller crowd than I expected. A few straggling journos wrapping uptheir stories for tomorrow. Only a handful of onlookers – most people inWestbrook have better things to do than stand and gawk at a police cordonat two in the morning. Two patrol cars. Probably a lot more earlier, so thenews could show off the gravitas of the policing profession, at least untilthe coroner arrived. Bags’re already bound for the freezers, so the onlypeople still left are those who do the dirty work.I pull right up to the tape. Before I can get out, a rookie uniform runsover. He waves at me to get the fuck away. I open the door and plant a footoutside.“‘Ey, ‘ey, ‘ey! You can’t park here,” he barks, his tone suggesting he’smilliseconds away from him whipping out his shock baton. “Crime scene.”“Is that what this is?”He yips something else, but stays on his side of the tape. We’re turningheads, so I take advantage and wave – “Brian!”I step forward. Rookie cop’s hand jerks to his taser. Before he can drawit, a heavy hand with a gold class ring thumps down on his shoulder.“Easy there, Sarge. I’ll take this one.”The kid doesn’t venture a reply as Brian moves him aside like a sparechair. I lift the tape, duck under, the kid’s eyes on me the whole time. Zapme in a heartbeat if he could. Finally, Sergeant Kid looks away. He startsexamining my cab, memorizing the number on the door. Until we meet again,tiger. Can’t touch me tonight, though.Brian offers his hand. When I extend mine, he grabs it with both hisgrizzly mitts and shakes. I remember his fist slamming into an Animal’s jawduring questioning. Jaw cracked like a dry branch. Broad shoulders, wide,square jaw, meticulously coiffed blonde hair without so much as a grain ofsalt. Brian’s the guy on the recruitment posters staring up and a little to theleft, but he throws a left hook like the poster boy for the NC Golden Gloves.One of the few cops the gangoons in our fine city are actually afraid of.“Good to see ya, Frank,” he bellows, squeezing my arm, maybe warmly,maybe checking my bicep. “Heard you drive a cab now. Shame. Always ashame when a good cop sets down his badge. But something tells me youdidn’t drive out here to shoot the shit about the good old days…”He can see I’ve started looking over his right shoulder at a group oftechies setting up the holograms.“Come on,” he says, “Doubt I need to tell an old dog like you how to do histricks.”He doesn’t. Police tango – how to step to avoid fucking up the evidence.Some things never change. Chalk contours on the asphalt mark out wherethe bodies fell. We got holograms, laser pointers, real-time visualizers,doo-dads that shoot your data directly into the subnet. But you’ll alwaysfind a cop who’d rather use chalk.I count. Eighteen.Don’t need to ask who’s who. The techies have already laid 3D hologramsover each one, semi-opaque ghosts of Valentinos and 6th Streetershovering softly over blood-spattered pavement. The holograms weregenerated from snapshots taken before the bodies were shipped off tothe morgue. One gang in red, the other in blue. Two techies step carefullybetween the bodies.Ten little ‘Tinos went out to dine…“Left, two inches,” says one techie. The other’s fingers fly over thekeyboard of an NCPD-issue deck. A dead ganger flickers, reappears twoinches further away. “All right. Let’s get the ballistics set up, gonna takeus till dawn…”Fine green lines appear in midair, interlacing, linking the two sides ofthe firefight. Some connect bodies, others fly off into nowhere. Bullet flightpaths, AI-calculated. Just for orientation now, but once the ballistics comeback from the lab, the entire scene’ll become a 3D movie.Ten little Valentinos… one, two, three… No Ora.“Classic Tuesday night firefight,” Brian is behind me. “Typical set-up,looks like. Someone makes a call, let’s meet, talk. Picks the spot. Could beover turf, could be payback for some random drive-by…”“Tell me something I don’t know,” I mutter as I search. From the tenth tothe first.“You ask me, a weapons deal gone horribly wrong. Sixth Street got theirhands on some heavy artillery. And despite what the pundits say on TV,they’re not gearing up for an armed uprising. Merch was hot, they wantedto pass it on quick, let it burn someone else.”Didn’t know that, but that’s not why I’m here.My eyes jump from body to body. Just the reds.Brian’s no idiot – got eyes and a brain. He says nothing but walks overto the guy manhandling the projector, whispers in his ear. A red holo fades.A woman’s form appears in its place. A form I know well.“Ora Di,” he says, as if introducing us. “Swapped the holo out so thosepaparat-pricks couldn’t grab a shot. Our innocent bystander – the one partof the story that’s a little less cliché. Don’t get many BD chicks showing upto a gang face-off.”Red haze. This time it disappears as fast as it arrived, thankfully.“Any hypothesis?” I ask.“Well, you’re outta the biz, but I’d still bet good eddies you know who’srunning the hardest crew of ‘Tinos in Vista. Emilio Aguirre. Six yearson Brooks Island. The judge said it would do him a world of good. Damnwell did – gave him some powerful, worldly friends. He met some Juarezchooms inside. Had all sorts of new tricks to show the barrio boys when hecame home. Anyone who jumped got cut: Jimmy the Butcher’s crew, JockBrennan…”“Yeah, I remember. Was still in the Fifth then.”“Yeah. And we’ve only found more since. Some big ‘Tinos, too. Didn’t evenspare his own brothers.”“Where’s Ora Di in all this?”Brian’s face twitches when I say her name. He sees there’s somethingbehind the question, he sees I see him seeing it, we both pretend we don’tsee a thing.“Everywhere and nowhere. Apparently, they cozied up to each otherbefore they put him away. But word about her didn’t start to spread untilhe got out. Wanna know what I think? Went about like this: when they met,she was the prettiest girl in Vista, he was a macho with a gun. Bet he beather and milked her for scratch, as much as he could. Instead of taking herBD eddies and getting the hell out, the dumb cow kept going back for more.Heard she was back on the block lately, so… checks out.” He pauses, glancesat the dead girl’s holo, waves to the techie. Holo flickers, disappears. Anonexistent Valentino reappears in her place. “Case closed.”“So… what?” I continue. “They forgot words, used bullets, and the girljust happened to be here?”“Yes, Frank. This is one of those cases where it’s better you don’t golooking for any deeper meaning. Waste of time, waste of life. Boys’ll wrapup here, I’ll spend a thrilling evening writing up the report, end of story.”I nod, but I’m not sure he’s right.Something’s not sticking, pieces’re missing.We stand silent. I wait for Brian to ask me why I really drove out all thisway. He doesn’t. Probably has a theory, but needs no verification just yet.Least not till someone pays him to get it. Yeah, that’s the lightly tarnishedside of the golden boy.I should leave, but something’s bothering me, I’m pinned to the spot. Ilook from body to body. No Emilio. Two lie face down, one on his side – maybeI haven’t recognized him yet.“Aguirre?” I ask. “Ora’s here, he oughta be too. Doubt he’d have let hergo alone.”“Not here,” Brian throws up his hands. “Looks like he sent the girl to dohis dirty work. Real gentleman, huh? Sent a patrol to grab him from Vistafor a friendly chat. You know, just in case. But he’d flown the coop.”One last glance at the holograms. The one hiding her body – smack dabin the middle. Weird place for someone with just one foot in the gang world,a tourist passing through.“Thanks, Brian,” I say, offering my hand again. He holds it a second toolong. “Good luck.”“Good to see you, Frank,” he says, looking me in the eye. “Guys like usshould stick together.”Huh. Guys like us.I turn, leave without another word.First, Braddock appears on TV to announce the NCPD is securing thescene where Ora Di was gunned down. Hours later, Brian Lee hides herholobody from the media’s hawk eyes. It doesn’t add up.A big-name investigation means money from City Hall. For overtime,cruiser tune-ups, bulletproof vests. If said investigation proves a spectacularsuccess? Means an even bigger slice of the city budget for the brave boysin uniform come next year. You don’t sweep a jackpot like that under therug. You also don’t give it to a guy like Detective Brian Lee. Far back as I canremember, the NCPD golden boy’s hands have been grubby with bribes rightand left. Fuckin’ reverse Midas over here. Pulls in a good chunk of scratchfrom strategically scattered, dangerous people. They make sure he’s neverfired and give him the orders and artillery to pour lime all over the NCPD’sPR pooch, Detective Braddock.There’s someone behind all this. Someone bigger.Maybe it went like this: Braddock got there first, stepped in front of thecameras, said what he said. Then Brian showed up, shoved all the bodies inbags, placed techies in their spots and shut down the whole circus. Questionis, why.I walk back to my car. Young gun’s gone. I get in.Had enough for one day. I drive home. Doubt I’ll sleep. Fuck. I step through my door, shut it behind me, glance atmy bed… g’night.I wake up late the next day. Same clothes, fresh hangover.I look in the fridge – yesterday’s pizza, two slices. At least one cup oflong-suffering coffee in the pot. But that’s what microzappers are for. Onthe news – not a word about Ora Di.Guess it’s no surprise. She wasn’t front-page material; more like pagetwo or three. Question is, were other people really that uninterested? Ordid the person who ordered her ignored have media pull?Or am I growing grizzled and paranoid?I finish breakfast, take a shower and find it’s late afternoon. Where aremy comms? I scroll through to find Timmy G.Timmy answers quickly.“Top o’ the moooornin’ to ya! Where to today, Frank-n-wiener?” he begins,his voice lunging at me like an amped-up radio host spouting verses from TheAnarchist Cookbook. He’s the guy you trip over while scanning the frontierfrequencies in insomniatic stupor. Timmy. Timmy G is a fixer. Timmy won’ttell you he’ll fix you the Moon, he won’t tell you he knows everyone in thistown and they know him. But. But. He has two traits on any other fixer inthis town: he always answers my pings, and I like the guy. “Talk dirty to me,choombo.”The sense of humor and composure of a perpetually held-back highschool freshman.“Timmy, need you to put your ear to the ground.” I hear him take abreath to interrupt, so I hurry. “Got a feelin’ someone’s about to unleashsome heavy iron on the street. Semi-automatics, machine guns, maybeheavier, though maybe not. Things you could hand out to street soldiers likethey were going trick-or-treating. And, wait for it… it’s NOT coming fromMaelstrom.”He doesn’t answer.“Timmy?”“Riddle me this, one old choomble to another…” he starts, then stops. Thequiet’s sweet for a moment, I try to remember how we met. I was still wearinga badge, he’d just started out fixing. Pulled him over, bullshit reason, brokentaillight maybe. Just so happened the trunk of giggly Einstein’s ride wasfull of neuroreactors. The very same neuroreactors someone had kleppedfrom a Petrochem lab the week prior. Merch like that’s a hard sell – itdon’t work in run-of-the-mill implants. Only clientele you’ll get are full bodyconversion types. Like, say, megacorp death squadrons. I let him walk fortwenty percent of the take. So yeah, you could say we were old choombles.“You got real specific feelings, man.”“Intel’s from an old friend. Former gig friend.”“Understood,” he says, and I’m sure it is. “I need to listen for somethin’particular? Like, you tryna know where the toys’re headed?”“More interested in where they came from.”“Choombaaaataaa!” he shouts in my ear like he was declaring a fuckingchoommunist revolution. Zero cool, this guy. “This gig’s startin’ to soundlike somethin’ your boy TG don’t wanna be hearin’. Like, kinky? I mean, I likeit. Ya got style, Frank. And a man’s gotta have style when he’s wadin’ intodeep, hot shit.”Timmy G may be a clown, but he’s not an illiterate clown. He readsbetween the lines.“You find anything, you know where to come.”“That’s what she said, Frank. Laterz.”He hangs up.I leave my apartment, walk down the third-floor corridor. Yeah, I’vethought of getting something higher up. Thought of it a few times: view’sbetter, stink’s fainter or refreshingly different – less the bold, stale greaseof the fryers below, more the subtle notes of noxious fumes billowing inthrough the vents. On the other hand, I’m already here, so fuck it. I leave theresidential sector, walk past the gun shop and up to the newspaper dispenser.I dig an eddie out of my pocket and feed the machine – my daily ritual.I hear Pedro and his Delamain diatribe again. Pedro can’t understandthat some things never change, never get swept aside by the forwardmarch of technological progress. They’ll be here forever, immune,immobile – meanin’ papers, cabs and cash. Broadsheets printed on pulp onlyfit to wrap synthmeat in down at the fryguy’s. Papers piled high, one atopthe other, fifty sheets of prime sleeping material for a man with nowhereelse to lay his head. Paper money, passed hand to hand under tables, rolledup tight and sealed with a rubber band. Stuffed into the duffle bags ofchooms off to the weapons-n-blow market, untraceable.And taxi cabs.I buy a copy of the Dataminer and pull out the thick, folded paper. Thereit is. Front page. She told me once she wanted to make the front page.Long as it wasn’t grinning like a culera alongside all the other BD starletsin VirtuJock Now!GANGERCHICK – INNOCENT BYSTANDER, VICTIM IN FIREFIGHTPic’s black and white, she’s smiling. The scoop: a poor, innocent girlwhose murky past came back to bite her. Not a word about the date withthe famous actor. No wonder – who gives a shit anymore?I leaf through the rest, then grab a copy of VirtuJock Now!There it is.ORA DI-SAPPEARS AFTER ONE LAST DATEThe hyenas never disappoint.I scan for names and spot the stage name: Zane Magnum.Guy she mentioned.Down on the parking level, I get in my car. One more glance at thenewspaper before I set it down on the passenger seat. Just before I turnthe engine, I remember one thing.Comms unit - Olivia Garland, Arroyo precinct, private number.“I don’t believe it.” Can’t see her, but I hear a smile. She was on duty lastnight, she’s off today, probably savoring her first sip of coffee as we speak.“Missed ya, Frank.”That subtle flirtation in her tone, light husk to her voice… I missed her,too.“Good to hear you, Liv. Even though the frequency’s not quite right.”“Ah, you got nothin’ to regret. Big man’s runnin’ the place like a south--of-the-border sweatshop. It’s good you got out when you did. That wayonly one of us gets an ulcer.” Big man – Commissioner Ramos. No love lostbetween us. “Heard you’re driving now.”“You ever feel like a new dispatcher gig, I could put in a good word.”“Same old loveable Frank…” We would talk, one or two in the morningwhen I was on a stake-out. I do miss her. “But, all right, you’re calling on biz,so get to it.”“You’re breakin’ my heart.”“Frank, I know you.”“You do.”“Whaddaya need?”“Actress got killed yesterday, O–”“Ora Di,” she interrupts. “You ever relive ‘Valentino Revenge’? Ooh, shewas so good in that. Seemed like a sharp one to me.”“She was.”“Was she, now?”Dead air. A slurp. She’s actually having coffee.“Body count was almost twenty,” I say, no biggie. “Think you could sendme a list?”“Oh, Frank, Frank…”“Pretty please?”Another slurp. The clunk of a coffee mug on a countertop.“I’ll see what I can do,” she says, finally, the smile still on her breath.“Your brother doin’ all right?”“Eh, you know. Take care of yourself, Frank.”She hangs up.Olivia’s brother is NCPD, too. Sits out his days behind the bars of Supplyand Facilities Management, handing out weapons, shuffling papers, rubberstamping shit. Fucking hates it. He was a detective in the Fifth once upona time. Then someone planted a corruption charge on him. Weren’t for me,he would’ve landed behind thicker bars.I start the engine. My hand reaches for the Combat Cab term. Old habit.I hesitate.UNAVAILABLENot today.I drive. Brainwave. Ora’s studio. Scrolling their latest in Pacifica at the HotelTropique. We’re Night City neighbors. Bought my pad just as the recessionhit and everyone flooded out, thinking the ‘hood would devolve into anotherCombat Zone. Then the film outfit moved in, set up shop on a few floors ofthe five-star-hopeful, started camping out with the roaches. Looks likea sad, forgotten place in a sad, forgotten silent picture. Neon signs longgone dark and dirty, smog-smudged windows power-washed by acid rainfor months, years. No future to be found.Brainwave. A beefy, chrome-jawed guard at the door. A teeny studiobadge on his overgrown chest. Those floating past and in he scans fromthe neck down, looking for the old-school IDs. I don’t even have to try. I graba techie, drag him around the corner, ask if he’d like a hunnie to take anhour-long coffee break. At the word “hunnie,” his eyes light up and he offersto throw in an audio team hoodie.I hang the plastic from my neck and glide past the gorilla. Just as Ithought – a badge is a badge is a badge. Inside, shit gets weird. Story time:the Hotel Tropique, one of the more spectacular failures of the 2060s. Atime when big men with big money rode yippee-ki-yay into Pacifica to erecta late-stage capitalist heaven on Earth. Right here, with rooms and pillowsynthchocolates for all at the Hotel Tropique, Hotel Haiti, a jungle-like atriumat the bizarro-named Grand Imperial Mall. The crisis hit. Whole ‘hood-wideproject went tits up and got stuck that way, thrashing, flailing, a handfulof Voodoo Boy wizards squatting here and there. The scroll stage at theTropique – a desperate, doomed attempt at reviving a dying biz. Lipstick ona pig.A faded, dusty reception desk. They’ve managed to hang a few screens,stand a couple of underpaid kids next to them. The kids take the fast foodfrom the delivery drones, nudge and shoo small flocks of interns, audio guysand camera crew like the undergrown sheepdogs they are. Sometimesthey vaguely point people toward the toilets. Well-dressed bubble-peoplefloat through the room, trying to outdo one another in import and gravitas.Each is the center of his or her microverse, waltzing through the vastcosmic sludge of brainbiz. A few security heavies in the mix – old habit. OneI recognize, worked at the same precinct. Jack? Jake? The jerk’s added agood ten pounds of muscle on his arms, his sleeves ready to burst like apair of Polish hot links. Left shoulder – RealSkinn. Nice, pricey toy, that. Foran ex-cop, the private sector is heaven on Earth indeed. More money, fewerproblems.Could’ve been me there, guarding nothing. Comms pinged a few timesafter I left the force. Good offers, too… good eddies. But I just couldn’t do it,couldn’t turn studio huscle. I’d have felt like a cop without a badge to flash,lugging around heavy toys Joe Cop couldn’t dream of affording. I’d have feltlike I was playacting, pretending. And I never liked to pretend.I walk up to reception and peer thoughtfully at the screens. One displaysa studio map:LEVEL 1 - CATERING AND LOGISTICSLEVEL 2 – WARDROBELEVEL 3 – TECH AND MAKEUPLEVEL 4 – SCROLLING STAGELevel two. Up the stairs. Left, left again, room 203: ZANE MAGNUM —bingo.I get moving. Dunno if he’ll be there, dunno if he’s even scrolling today.Can’t hurt to check.Stairwell’s empty. My eyes jerk to all the corners for cams. Can’t saywhy – not like there’s anywhere to hide. Level 2. I hang a left, then left again,I’m in front of his door. Knock-knock. I wait. Nothing.I try the handle. It’s open but nobody’s home. Instead, there’s a righteousmess – mounds of empty scop pockets, drained vodka bottles, crumpled,soiled clothes and other sundry shit. The light’s on. Security woulda turnedit off after a hard day’s softie work, so Zane’s gotta be on set. I leave.Stairs, next floor up. People everywhere, not a head turns my way. That’sthe studio magic of most scroll sets: just look like you got a right to be there,like you know what you’re doing, and nobody’ll ask you any stupid questions.Ora told me why. Showbiz is the biz of being nice to people. The fewer youtalk to, the fewer face-cramps you get from all that fake smiling. No closeddoors here. A long tangle of cables black-taped to the floor every few feetkeeps ‘em open. The cables veer off into rooms lining a long corridor. Iwalk down it and catch what’s inside – BD calibration seats. Conversations,in pieces, float up to my ears. I’m looking for a thread to follow.“No, no, no, here, right there. Slide ‘em aaaall the way up when they stepin the club…”“Saturation, crank it. The eyes, I want ‘em crying blood. Just their sight,don’t you dare touch hearing or taste…”“Need ya to get me that techie from Wats on comms. You know, guy whodid the emote sigs for ‘Queen of the Afterlife.’”“Oh, man, I’m gonna hurl…”“Stop fidgeting and relax. You go on set with that hangover, we’ll haveto toss the whole scroll.”I peek inside.Hello, Zane.The tabloid coverboy’s coif could use some gel. Looks kinda like someonecrumpled him into a ball, regretted it, then tried to smooth him backout. But it’s Zane all right. He sits, a thick cable feeding into his skulljack,thinner ones sprouting from his wrists. A techie sits next to him, doing hergirl scout best to be nice.I shove the ID in my pocket and walk in. I’m ignored. I stand and stare forten seconds, more… it becomes painfully clear I haven’t washed up in thewrong room. I look at Zane. He doesn’t see me. With his goggles on, he’sdeaf to the world. The girl turns. Young, pushing twenty? Heavy geishawarpaint, severe bangs, shapeless sack-clothes that lie a little too well tobe hand-me-downs. The big purple insect lenses in her cheap frames don’tjust look great – they display diagnostics, too.“We’re busy,” she says, irritated, as if to a janitor come to mop up Zane’spuke. “You one of Ben’s boys? Tell him we need a few more minutes. If youdon’t mind.”“Not Ben who sent me,” I answer. I look at her. “I gotta talk to Zane. Giveus a minute.”“Seriously? We’re running late already…”She fidgets. Like there’re fleas in those shapeless pants. It’s nibblingat her by now. I could be someone important. So how’s she gonnawriggle out of this? Zane can either be another half-hour late, or she canfob me, potential VIP, off. She scratches at her cuticle. Hypnotic fractalsleap across her nails.“I gotta talk to Zane,” me, calm and low.She makes up her mind, flounces her bag-pants out the door. Shecan’t slam it, but shuts it far as it’ll go. It thuds against the braid of cablesbetween door and jamb.“Fuck…” Zane yanks off his goggles with a neat velcro crunch. With everythingfirmly jacked into the gear around the room, he has to hold them up in theair. “The hell you want?”I take the techie’s chair. I look at him. Bloodshot eyes, bloodshot skin.Swollen red face of a choom who hit the vodka so hard his maltreated bodywas forced to take on water. Cotton-candy muscles that look great oncamera. A juicy, deepening bruise under his left eye. Interesting.“I don’t know you,” he observes, like he found a fresh turd under his shoe.Doesn’t even try to be nice. A page two buffoon who thinks the front page’llbe his any day now. Little does he fucking know that any day’ll never arrive.Christ, no wonder Ora hated him.“What do you want?” – slow now.“Wanna talk,” I reply calmly, though it’s a struggle. I wanna punch thisguy. “Got a few questions about Ora Di.”“You a cop?” Most logical conclusion if a stranger pays you a surprisevisit and has a few questions. Or… is it that I still stink of cop? “Sure tookyour fuckin’ time.”Weird. Brian meant to bury this case, but his people still should’ve talkedto Zane. If only to pad the paperwork.“You met up, night before she got shot,” I say, ignoring his stupid comment.“A hot date you two had.”He looks at me with big sloshed eyes. Wonders if I’m asking or telling.“Fuck, man, you mean the marketing bullshit?” he answers, unsurewhether to be afraid or indignant. “Go ahead, check upstairs, prolly someinvoices for the dinner and drinks so they can write it off.”“Uh-huh.”“You know, if we’d of felt like taking it back to the hotel, they’d of expensed that, too.” When he says hotel, his filler-puffed cheeks spread into a sicklygrin. “They pay for everything, long as you get enough people following,taking pictures for the papers. You know?”“So you wanted to?” I toss it out to see if it sticks. “Take Ora back to thehotel?”“Nah, man, you’re gonked.” He shakes his head. “Her input…”He trails off in abject terror. Still a swig or two of survival instinct in hiswaterlogged body. Zane might have the bulk, but he’s the real teddy bear.Terrified that if he says one word too much, the ‘Tinos will remember wherehe lives or what car he rides backseat in.“I know Emilio.”“So you know what would happen to me if I touched her.” Using his words,now – doing a little better. Oh my sweet, simple gummy bear, paid well tolook good but stay soft. If you only had a heart. Couldn’t give a shit aboutOra’s death, not an ounce of respect for human life in you. “‘Tinos wouldof crucified me on some picket fence in Santo. Those chooms don’t fuckaround. Fuck, I didn’t even wanna show.”Interesting.“Why not? Creative differences?”“No, man, it’s not… She was hard to work with, you know? Here, you gotpeople, normal people.” When his lips say normal, his eyes look me up anddown. “But she was, you know… You know?”I wanna sock him in his good eye.“’Fraid I don’t. Tell me.”“Fuuuck…” He twists and shifts, a discomfort I savor. “She knew people.But not like, you know, normals. Not some huscle who knows a fixer whoknows who to call, you know, just in case. Her people were the ones youcalled, right? You say the wrong thing, look at her wrong, shit could get bad.”“She aggressive?”“Choom, you ever relive any of her scrolls?”No, choom, I haven’t. Ever. But I don’t want to give this spray-tannedmarshmallow the satisfaction. He’ll just have to use his words again.“Slot it and you feel like you’re on one bad trip, you know? Like you havethis itch to, like, look over your shoulder, but you hold it in or whatever. Whythey paid her so good. You pay for the feel. To feel like someone else. Andshe was someone else. She was a fucking… animal. You don’t even know,man… you never knew if she was gonna run or fight.”“What was she like on your date? You remember, notice anything?”He hesitates, but this time he really needs to talk to somebody.“Hand me that bottle with the vitamin shit?”I grab the bottle, a blue liquid sloshing inside. I smell the vodka oozingout of him.“Thanks.” He drinks slowly, buying himself time to arrange the facts. He’sbeing cautious but honest. “Her and her input. Fought about something.She was yelling at him, just caught a few words. But choom, if they startedthinkin’ I was out to get something, you know, from her…?”“They’d hack your nutsack off.”“Yeah.”“That’s all I know, serious. And man, I’m late.”When he says that’s all he knows, he deflates.“You tell anyone else?”“Studio huscle. Came over that night, soon as the news broke. They’rereal quick.”‘Course. Studio needed to stem the rising PR crisis, fast. ‘Course. They’repaying Brian to fill out the papers, get the whole thing filed away in somebasement. They might’ve even written the report for him, got enoughex-cops hanging around. Wipe any and all traces of Ora; first the asphalt,then the files, then the media. Lots of money, lots of hustle, zero moralfucks given.I stand to leave.“That’s all I know, man, seriously. . .” His voice lingers behind me as I walkout of the room.I don’t turn around. Leave him there to sit and stagnate. A man-toyabandoned, tethered to his spot, with a black eye to nurse and a babybottle of vodka to suckle, the better to forget he’s just another fuckingscreamsheet byline they can rub out the second they get tired of him. They call him Cejas. Owns a tech shop. I know Cejas from the good old days.He and his thick eyebrows’ve been running the joint since before said dayswere good or old. Wanna talk to him. Ora brought him up a couple times –they were close – and Cejas is one of Emilio’s top brass. High up enough toknow what went down. Might tell me why Ora was at that meet.I pull up to the store. Comms blinks: a message from Olivia. That wasquick. Very quick. I run my eyes down the list – names and nicks. Interesting.She left a voice message, too.”First three are heavy hitters, insiders, direct line to Emilio Aguirre. Hiscaptains, say. Three in one place means no accidental bump in the night.‘Sides that, our starlet and a few soldiers, couple of minors on each.”She pauses – the message continues. Silence crackles for a few beats.”Don’t go sticking your fingers in this case, Frank. Not if you can help it.Little bro says hi.”She hangs up.I leave the car parked out front. Bright red neon: CLOSED.I try the handle. Open.Empty. Nobody home. Big boxes stuffed with inert gear. Flickeringscreens tuned to dead air but pulsing to a faint bassline throbbing fromtall, spindly speakers muttering Mexican rap. Drones, transistors andcables. Cables everywhere, cables running over everything and aroundeverything and through everything. Cables dangling off shelves like weirdSpanish cybermoss. Voices. Off to the right. I move, turn the corner arounda looming shelf of cable-twisted chrome, and see I’ve come at a very badtime.Cejas is sitting at a table, head in his hands. Hunched, cowering. TwoValentinos flank him, right and left. One’s familiar – Corto. Two years at SanJunipero. Carjack with a real short circuit. Quick to draw, suspect in at leasttwo first degree murders, never convicted. The other ‘Tino, the one I don’tknow, speaks.“We’re closed,” he spits and moves toward me. Corto stops him with awave. “What?”Flashback: five years ago. Eerily similar sich. I’m wearing an invisiblebulletproof vest with Organized Crime tattooed across its chest. Had Ishown up here in that vest, it’d still be unpleasant, tense, but the ‘Tinoswould have it in the back of their heads what happens when a cop gets got.Problems, problems for everybody.But that was five years ago. I’m not a cop anymore. Question is, doesCorto know that?Man’s changed since I last saw him. Swapped his left forearm for chrome,covered the rest of his body with sharp-angled tattoos in shrieking colors.New, expensive tattoos that morph in places, cyberware shifting the dermalink in real time. A snake, the Devil himself, the Holy Virgin, seven blades inher chest.Corto looks me in the eye, breathing shallow. He calculates. Wonderswhat to say. I wonder if I wanna interrupt his thought process. Do I let it runits course? No, gotta cut his math short, do what I would do if I still held abadge as my shield.“Closed? Even better,” I say and step toward them. “Wanted to talk toCejas in private.”Corto keeps his eyes on me.“Cejas is busy. Right, Cejas?”Cejas stays silent. His face stays glued to his hands. His elbows rest onalabaster-white plywood. Blood seeps through his fingers and drip, drip,drips onto the smooth, clean surface.“So I see.”From Corto, the slightest of nods. The other guy stands, circles aroundme, stops at my back. I don’t like this at all.“Let’s see it,” Corto says.His upper lip rises, a rabid dog without the growl. New titanium teeth.Fuck. Miscalculated. Badly. Set my badge down five years ago, forgot tobring it with me today.Slow and steady, as if reaching for my gun, I slide my hand inside myjacket.Another nod. Even smaller. Microscopic, so much so it should go undetected. I sense it.A rush of movement behind me. The ‘Tino’s fast. I’m faster.The world plunges into the warm, gelatinous wine of Sandevistan. I spinaround at full boost and pray my muscles can take it. If they can’t, they’lltear clean off my bones.Hand. Gotta get the hand. Hand with the gun. The hand pulling theUnity out of its holster, aiming to empty it in my gut. I strike his elbow. Thesickening snap of breaking bone. I strike his wrist. A heavy boot on brokenglass. The gun falls, falls from fingers open wide in surprise. A swift partingkiss to his jaw, and I reach for my gun.Too late. Corto’s beside me. The dull jerk of the knife as it sinks in undermy right rib. That’s it. This is how it ends…Or it would be if I didn’t have a metal plate in lieu of a rib. A lucky charmfrom the time a Maelstromer decided to test his mantis blades. I got twomonths in the ER and a medal.Fuck the gun. I grab Corto’s shoulders and channel my entire boostedmight through my forehead, into his face. The knife drops. Corto slumps.Sandevistan courses through my muscles, pulsing, fading. Tomorrow.Oh, tomorrow. Tomorrow I’ll wake with the biggest fucking hangover. Like I’dpounded back a whole convoy of Centzon and lived to regret it. Pain shootsthrough my body, like someone strung me up piñata-style to whack the shitoutta me with a telescopic baton. Christ. I can feel it already.Choom whose arm I snapped in three is back… He shrieks in Spanish andbolts out the door. Deep breaths. One. Two. Three. Better. I grab a plasticfolding chair and take a seat at the table. Cejas has separated face fromhands. He eyes me like a beaten cur. Can’t say I blame him; he just rose fromthe dead, too.“Got a couple questions,” I say, glancing at Corto to be sure he’s lyingwhere he fell. Good boy. “Cejas?”He doesn’t answer. He sits and looks at me. I slap him. Not hard. Enoughto remind him where his head is.“Cejas.”He doesn’t cower, doesn’t duck behind his arms. There’s a ganger inthere after all. Something shifts in him. He rubs his jaw, scratches his arm,shakes some life back into himself.“You the badge. One who drove Ora ‘round.”Color me surprised. Blindsided? I got so much surprise I don’t knowwhere to direct it. Is it that Cejas knows who I am, or that Ora told him aboutme? Feels like someone revealed a dark secret.“In the flesh. Call me Frank.”“Ain’t your choom,” he answers. Sure. Rules are rules. “Whatchu want?”“Wanna know what went down in Charter Hill.”“Watch the news. Tuesday night firefight. Gang war. You ain’t heard?”I feel like slapping him again, harder. Keep my hands to myself. I reach,pull out my gun, lay it on the table. Thud. Maybe this’ll change his tone.“I heard,” I begin slowly, calmly, looking pointedly at the gun. “Sixth StreetRough Riders got in a tussle with some hot-blooded ‘Tino boys. A BD starlethappened to be there. A victim of her own innocence, naiveté. Her unsulliedvirtue opened the door to her dark, murky past and let it in to ravish her.”He snorts like a wet dog. More offended than mad? My boy Cejas is barelyholding it together. He doesn’t want to be the guy holding the slice-n-dicedcop giblets, though. Time to lay out all my cards. Maybe he’ll show me oneof his.“Lemme tell you a story, Cejas. You tell me where it turns fairytale. Ourmano Emilio made a nice Valentino career for himself, climbed the ladderrung by rung. At first. Then he made some new chooms on Brooks Island,they backed him, he started hopping, skipping, jumping. Pushing merchworth tens of thousands, money enough that it needed scrubbing.” I glancearound the store. Half the shit here’s ready to start a new life on a new sideof the border, or it was lured here with dirty eurobucks. I know it, Cejasknows it, doesn’t matter. “Ora was busy building her BD career. Time andagain, they told her to leave, but Emilio was her shield. He feared no one,so she feared no one.”„¡No mames, cabrón!” – it bursts out. I can see he didn’t want to, but ayay ay, the milk’s outta the glass and he’s not gonna cry about it. “She ain’tneed no fucking shield. She the same as him. Hungry, get it?”“I get it. I knew her.”“Emilio never pushed her, never tol’ her what to do. Shit was the otherway ‘round.”He stops. Too late. Plop. One drop too many, spilled. But I can’t let Cejassee I saw it, not yet.“Charter Hill,” I circle back. “You boys got stacks of eddies, but theyneed a bath. Meanwhile, down on 6th Street, they got merch, but not anenny to their name. This gang war is a media-stirred cocktail of pure,unadulterated horseshit. Keeps city hall warm at night, though. ‘Yes, yes,the body count’s up, but don’t look at us, blame the baddies down in Heywoodthat can’t stop pew-pewing at each other.’ Like I said – horseshit. Think weboth know that fire’s been ceased.”He nods. A nod like a nervous tic, but he’s listening. I talk on.“Emilio sends Ora to seal the deal. Why? Already got Buchón there, yougot Smith, Jimenez…” I toss in a few of the ‘Tino names Olivia gave me.They stick. Cejas sees I’ve done my homework… and starts to crumble. “Ormaybe he didn’t send her? She just happened to be there, you know, passingthrough…” I finish.He says nothing, differently. Anger’s gone from his brow. Something’sthrashing around inside him, trying to get out. I wait.“They fought about it. Bad.” I catch a note of tender dismay. “Emilio didn’twant to talk to 6th Street, but Ora talked him into it. Said they had to think likethe big boys, do real biz, you know? You don’t stack eddies, you invest ‘em, diversify. She said it was time to stop playing stupid war games, gangs aredone. But we still had to get our slice before the fucking collars rode in topack it up in their portfolios.”She would say that.“What about the others?” I ask. “Emilio’s still boss.”“Corto stood with Emilio, normal,” he wipes his battered brow, glancesat the body laid out on the floor. Directs some hate its way. “Corto look upto him the same way he look up at La Virgen. But Buchón, Cortez, Smith…they listened to her. Maybe Corto was right. Maybe it wa’n’t worth it…”“Not for a half-dozen crates of assault rifles?”He frowns – angry, surprised, I can’t tell.“Rifles? Vato, it ain’t about no rifles…”He breaks off. His eyes jerk over my left shoulder. The door creaks.Fuck. The guy that got away. I forgot. I follow Cejas’ gaze to see what the‘Tino dragged in. My gun’s on the table, I don’t reach for it.He’s maybe sixty, maybe eighty. Whatever it is, it’s a damn lucky number.Most people in his biz don’t make half that. They call him Padre. A gangerex-priest with Juarez ties. Spent years in prison. Saw pictures of youngPadre once – his entire holy body covered in tattoos, though he hides themnow. They say Padre found his faith some time ago. They treat him as if hewas ordained. I doubt it. Not gonk enough to ask, though.Padre says nothing. He drifts over to the table, not a glance at Corto.He looks at me.“It is finished.” I hear a thick Mexican accent; I hear my time is up. “Timeto go home.”Cejas. Got one more question for him. Saved the best for last, the oneabout the fucking guns. But Cejas is no longer with us. There’s the shapeof a man, you can look that shape in the eyes, but the light’s gone out. Theman behind them snuffed.If what they say about Padre is true, they won’t touch him. Padre is afixer. Heywood’s sole fixer. He good shepherds his people, keeps them safe,pulls them off each other’s throats if needed. Story time. Took a call once,some choom was out there waving a machete, ready to lop off another guy’sarm. Over a girl, what else. One of those calls where you don’t go to askquestions, you go to shoot, because the motherfuckers you’re bound to findare bound to be out of their goddamn heads. Padre got there first. We pulledup to see him standing between two brain-boosted, chromed-out gloweringgangoons, between two machetes, each bigger than my arm. Padre walkedover to one, slapped him, shouted something about loving thy neighbor andtook the machete from the ganger’s hand like a toy. Didn’t bat an eye.“It is finished,” he repeats, a little lower. The file on his Juarez activitypops into my mind. It’s the tone for ordering a slow and painful scalping.“Let us go.”I stand, reach very, very slowly for my gun. Place it gingerly back in itsholster.Padre looks me in the eye the whole time. He walks over to Cejas, placesa gentle hand on his head and bows his own. For Cejas? For himself?A nod points me to the exit. Padre leads me out, even holds the door.A send-off committee stands outside. Six Valentinos, including the nowgimpy-armed one. I know what they’re waiting for. “It is settled,” Padre says to them. Their faces – angry, vengeful at first.Now utterly obedient. They don’t even shoot me a dirty look. Padre turns tome. “Let us talk. Do you know why you are still alive?”“Think so,” I say before I actually do. “God’s will, right?” – with a twitchof my brow. Yeah, good going, champ. Piss off the guy who could unsettle what wasjust settled.“Don’t get smart.” I can’t tell if it’s a scold or a joke. Can’t read this guy atall. “Life should be respected. Your life, the lives that waited for you outside,the lives still inside.”“Corto’s alive.”“I know. As are you.”Awkward silence. Awful.“Last night, some acted without respect for life,” Padre resumes. “Today,many others have come here with many, many questions. You are not thefirst, you are not the last. Some seek the sinners, others seek to hide them.But none has respect for the life of his brother, of his neighbor.”He knows a lot more than me. Might be the only one in this world whohas the whole story.“Who’s guilty, Padre?”“Let us walk.” He nods toward my car. I open the door, get in. He sitsbeside me. When was the last time someone rode shotgun? He stops meonce more. “You live because she spoke highly of you.”Don’t know what to say to that. I nod and start the car.“Where to?”My hand itches to hit dispatch. Got a client, don’t I? Padre points:straight, turn here, go back. We drive in circles for a while, make surenobody’s following. You don’t get that many wrinkles by throwing cautionto the wind. Padre’s face was dug by the Devil himself.“My first time in a Combat Cab,” he says. He shoots a decoy glance aroundthe interior. He’s going somewhere. He taps the bulletproof divider. “I wouldusually sit in the back, no? For safety.”“Mhm,” I nod. “‘S how it works. You call, order a ride, I pick you up anddrop you off. Pull you out of trouble if need be.”“A little like this, right now.”“A little.”“When I leave the car, we are even.”“Yep.”“And if they shoot me in the head two minutes later, that is not yourproblem.”“You let go of the handle, you let go. Ride’s over.”“I see. And if they shoot me the next day, in the middle of the night duringa gang meet, you come to check on me?”I don’t answer.He smiles. No hint of mockery. Warmth, actually. Weird.“Turn left.”“Where we goin’?”“To meet a friend. You may want to speak with him, but even more, I thinkhe must speak with you. He’s lost, you see. You could show him the way.There are hounds out for blood, and they are swift. But you are no hound,Frank. You are more like a dog. Loyal. Good old Frank. Who wished to be a wolf.”He’s pleased with his metaphor, though it’s biblically lacking.“Who was in Vista before me? NCPD?”“Sixth Street. The situation is tense, but this you know. No one wants toappear weak, no one wants a war. Sadly, it may be these wishes are mutuallyexclusive. And then everyone will have problems. Your old friends did come,eventually. I told them to leave, in so many words.”“Don’t get along?”“They asked the wrong questions.”“And I don’t? Didn’t tell me to fuck off.”“They wish to place blame. You seek… a reason.” He stops to point me inthe right direction. “The building to the left. Park there.”We park in front of a toppling hotel. Grime central, out in the sticks.Its neon sign still glows, kinda. H and L – OK, E spasmic. Building looksabandoned. But it’s not. We walk in; the cryptkeeper at reception doesn’t botherto lift his head. Elevator out of order, Padre steers us to the stairs. Secondfloor, third. A long hallway veined with flickering, humming fluorescents.Plaster peeling off like wet, festering sores. Place stinks of damp, mold, rot.319. Padre does the honors. Knock-knock-knock. Pause. Knock-knock.Pause. Padre enters.Room’s clean, relatively. Walls aren’t disintegrating. Working large screenTV on one. Other than that – a double bed, two large duffels containingclothes in the corner, a table… and guns. Lots of guns.My friend sits on the bed.Emilio Aguirre, aged a few years compared to his file photo. A fewpounds heavier, too, but most of it seems like muscle. Broad shoulders, thickbiceps, a large tattoo across his pecs – skulls and flowers and Spanish…about death, most likely. Chrome, purposely exposed, where his leftshoulder used to be. Tired, dark-ringed eyes. Like he hasn’t slept in days.Emilio lifts his gaze. Padre speaks. Speedy, rat-tat-tat Mexican rap. Idon’t understand a word. Quick but calm. Padre is always calm. Emilio nods.His eyes are sunken but alive, bright. There’s a man in there, still burning.They’ve finished. He looks at me.“Remember. It is for God to judge.” Padre glides calmly out of the room.We’re alone. Emilio stands. He comes over, as if to take a closerlook. He’s a mountain of muscle but doesn’t invade my space. Weird.Un-ganger-like. Emilio walks to the fridge droning in the corner. It’s emptyexcept for a fifth of bourbon, half-full, less… He takes a swig, wipes his mouth,hands it to me. It’s sweet, sharp, the warmth spreads to my bones. Cheapbourbon’s good.Emilio stretches out on the bed. I take a rickety chair.“What do you want?”“Answers. To a few questions. That’s all.”“It’s what everyone wants these days. Usually it’s the same damnquestions, too. ‘Cept nobody wants the truth, vato.”“I do. And my questions are different.” I take another sip. I smile.Situation’s a divine, gut-busting joke. Is he cracking too? It dawns on us thatwe’re holding a wake. “What happened, Emilio?”“They shot her. You know that.”“Not in Charter Hill, not in Vista. Charter Hill’s a stack of holos – the result.The reasons lie elsewhere.”He looks at me, surprised.“You do ask different questions. Ex-cop, right?”Weird. No gangoon aggression. Maybe Emilio’s not so bad after all…Who’m I kidding – he stabbed a guy seven times over a fistful of eddies.Another murder nobody could pin on him. But we knew.“This world, the gang world, you’re familiar with it” he continues. “Otherside, sure, but you’ve done time here. Gangsta life, puto, all that shit, youheard it all, seen it all.”“Nowhere near as much as you.”“Don’t matter. Carnal, gang war – tell me who wins. Who gets the glory?The laurels, the spoils? They go to the strong or the rich? They go to theone with more guns?”“Never thought about it.”“You should.” He’s smart, I’m surprised. Honest to God, thought he wasa loud, furious gonk who thinks it’s all about shooting up other gonks andshaking ‘em down for scratch. There’s more to the story and he knows it.“Lemme tell you. Glory goes to he who conquers his heart. It’s a fight forour souls, this war. Look at us, look at 6th Street. La VirgenMaría, long livethe NUSA.”My comms pings. Leaving Emilio to his musings for a moment, I reachinto my pocket. Timmy G.”asked around, got some fukin answers - u gon fuckin flatline”And another.”not on comms tho. even hashed and salted. need u to come over”Should put him away, but he fires off one more.”got us in some hot n spicy shit choom… tread careful.”Jesus. I look at Emilio.“You’re right,” he says. “What happened in Charter Hill – the result. Holos,a trick of the light. But the cause? Ambición. Desesperada y desmedida.”He brings the bottle to his lips, drinks his fill this time. Then he caps it,sets the bottle aside. The skull on his chest grins.“Jones called me. Sixth Street Jones,” he begins. “You don’t know him –new guy, only been running things a few months. Started by fire-clearing aspace for himself, cut three off the top. ‘S got nomad contacts too. No ideahow. Those pendejos play a good game of hard to get. Jones brings thingsin that don’t come easy. Fixers love him, gangs respect him. Mr. Jones evengot himself a couple nice police dogs.”I wonder how much he knows. About me. Like how I bit the hand that fedme and ran.“Go on.”“Jones had hot merch to unload. Red-hot, burning, so he had to toss itquick. He called me.”“The competition? No secret that fighter jets and hammerheads don’tget along.”“Ceasefire,” Emilio shrugs. “We tried to talk. Thought maybe we’d go intobiz together. Start out by showing some goodwill. Symbols, rituals, theymean something. Jones thought this could be it.”“Ora thought you should buy the merch,” I confirm. “They hadsomething everyone wants, bad – why shouldn’t it be yours? You had thescratch.”“It wasn’t about the merch, holmes. Wasn’t about the scratch either. Itwas about her. It was always about her.”“Not sure I follow.”His face somehow sinks. Not sure he’s got a heart in there, but if hedoes – it’s shattering about now.“She hated the virtu shit. She loved money. No. She loved not relying ona damn soul but her own self. Never wanted to be a gangerchick. Neverwanted to be Mrs. Emilio Aguirre. She was Ora Dominguez and it’s all sheever wanted to be.”“Sure sounds like her.”“Her curse, carnal. Before she got famous, nobody listened to her, never.Nobody!” He stands up, his fists clenched. Furious now, helpless… and it’sfucking terrifying. I see now why Ora stood by him those years. He doesn’thave what I saw bring so many others down under interrogation. Emilio’snot self-destructive. His wrath is infectious, it’s smart, it’s the booster youcould never afford. “Smith, Cortez, ay, even fucking Buchón… They couldn’tget it through their skulls that little Ora might be right. About anything. Butthen she talked to some reporters, showed up in some papers, sat on a fewfucking interview couches. And suddenly the boys listened.”“Gangerchick and star.”“A woman who never wanted to be a star, but went up there just to see.Came back with some souvenirs plus the conviction she could handle a packof thieves. Tell you one thing, vato: you don’t learn that shit off a scroll.”I think of Ora. How she never felt at home. Not on set, not in the gang.Everybody needs a home. Otherwise they wander, searching.Emilio leans against the wall, takes a deep breath. I’ve got one, twoquestions tops before I’ve overstayed my welcome.“Charter Hill – what happened? Was it a set-up, an ambush?”“No, but… Jones was acting weird, even for him. Wanted to sell mesomething – bad, quick… but he wanted a lot of scratch. Quick and high pricedon’t usually go together.”“He tell you what? Weapons?”“Prototype. Was supposed to show me in person at the meet. Said if Ididn’t want it, I could help him find someone who did. But he was prettyfucking sure it’d get my dick up. When he saw Ora he panicked. Was afraidshe’d talk. Was more afraid of that than he was of a war.”“Would’ve trusted you. Whole thing would’ve gone down quiet if it’d beenyou.”“Probably.”He falls silent. He looks off into the distance. His pain is palpable. Inhis head, over and over, a question he already knows the answer to. Can’tchange what’s done and gone, can’t change what’s settled.“Jones is a dead man,” he adds.That I believe. Hard to say if Emilio will survive this war, but Jones won’t.I gotta ask.“Why’d she go alone?”He looks me in the eye. I see grief, wrath, sorrow. I hold his gaze.“Sometimes you see the dots but can’t connect them,” he answers. “Inever… never thought my chooms would follow her, never thought they’dsee a new Ora, not the one from five years back. I missed the hour when herstar shifted. Did what I’d always done – slammed the door and left. Thoughtit would end there.”I nod. He’s said everything, anything that mattered.I stand. No thanks, no goodbye. I extend my hand. He’ll respect that.“Didn’t ask me what I’m doin’ askin’ all these questions.”“Didn’t need to, carnal. She told me about you.” While I was in with Emilio, night fell on the city of its name.No one outside the door; Padre left us to talk in private. No Valentinos insight, though they gotta be close. Next room over, maybe? I listen. Nothing.It’s quiet, empty. I walk downstairs, past the keeper of the keys, who sitsexactly where I left him. I walk out the door, invisible as a ghost.I get in my car. I’d really like to talk to Jones, but I don’t know anyonedown on 6th. ‘Sides, got that thing…My old choomble, Timmy G.Timmy doesn’t live in Northside, thank God, but it is still Wats. Oh well.I don’t catch Timmy in the flesh too often. Could count on one hand thetimes we’ve met, on one finger the times I’ve been in his pad. Fixing’s arelatively recent fascination for him. He’s spent most of his Lost Boy yearshooked up to an IV and skulljacked into a server, ‘runner goggles blocking outthe world. Timmy the Fixer doesn’t have a ‘hood – he has a subnet. Doesn’trule like Padre – shepherd to all his lambs. That’d be a Net impossibility. Hewouldn’t want to anyway. Probably for the best. Probably why Timmy G’sstill alive and shouting.Twenty minutes and I pull up to the postindustrial wasteland my fixercalls home. The merch. What was it Jones wanted to pass off to Emilio’screw so badly? “Prototype weapon.” Emilio knew exactly what it was, didn’twant to tell me.I step out of my car. Eerily quiet street. Dry leaves rustle. Elms. Can’ttell if it’s just this corner of Wats, or if something’s really off. Got a badfeeling in my gut, but what’s another bad feeling when you’re rounding outday three of a non-stop, commercial-free bad feelings marathon. I leavethe car on stand-by: cameras on, live feed to my comms. My eyes and earsoutside once I’m in. Just in case.I go in, climb the stairs, ignore the cameras. One hums and follows me.Paranoid clown. Timmy lives on the third floor; takes up the whole thing,actually. To get in, you gotta call him; then he cracks a security door in thestairwell. Rest of the building’s empty. Probably. A negative space waitingfor the gangoons to come in and squat, pop out a turd, lay claim to it. Couldalso be Timmy keepin’ it peaceful and quiet. Who knows.I walk up to the security door. This’d look great in Supply and FacilitiesManagement. Evidence room, yeah. I raise my hand to hit the videocommsand see…Door’s open. Ajar.Fuck.My hand jerks to my gun. I listen. Stairs quiet. Empty apartments, aboveand below – quiet.Could still bolt downstairs. Jump in the car. Drive off. Call Timmy, checkup. Maybe he just forgot to lock down.Who’m I kidding… Timmy would’ve shut it twice, checked it three times.Fucking tin-foil ranter.I glance at my comms. What time’d he ping me? Wasn’t that long ago;visitor could still be inside. Nothing on the cam outside.I go on, squeeze through the crack in the door.Another long, dark corridor. To the left – one door, three rooms. To theright – one door, two. Choices. Last one on the right is Timmy’s “office.” CanI take two shots of Sandevistan in 24 hours? No idea. Rather not chance it.I tiptoe, inch my way down the hallway, the barrel of my pistol raised, athird eye. First room – empty. Hard to say if someone searched the placefloor to ceiling or if Timmy just abides in chaos. Second – more of the same.Filthy, silent as the tomb. I check the third; I hear a thump down below. Maybethe murmur of the wind? A cat, a bat, a rat…Maybe we got company.It creeps up on me: they might’ve been waiting. Knew I’d go in.I grip my gun tighter, steady my nerves. I step into the office.Timmy G in his netrunner chair. Inert. Unnaturally red. Drool drip-drip--drips from his slack mouth. Kinda stinks. Probably always kinda stinks inhere.His pulse: flatline.Timmy was right. Up to our necks in a river of red-hot shit.Bulging, burst veins. Must’ve pinned him down, roasted him in the Net.Maybe nothing happened here, not in this world. Door just creaked openwhen Timmy let go.I take the goggles still linked to his deck, lift them off his eyes. Gently.Carefully. Need to peer under the eyelids of the dear departed, see wherethe hell he was when they got him. Could pull up the logs from his last sesh.But-but… Feel a little weird, poking around the files of someone who justshoved off this mortal coil. Might be my only chance, though. I punch a fewbuttons on the keydeck and hear footsteps just outside.Damn. Company. Waiting for me the whole time.I have the goggles in one hand, my gun in the other.“Easy there, pal,” I hear through the door. A voice, so familiar.Familiarity – the only reason I don’t fire up Sandevistan and shred myself.“Easy. Put it away.”I flip the safety and holster my iron.Brian is calm. Not at all surprised. I see it now. He was waiting. Noquestions, not a glance at the body. He was here long before I arrived. Briantakes the ‘runner gear from my hand.I nod toward the left, then the right.“Yep,” Brian answers. “All around us. Upstairs, downstairs.” He pulls outa small cloth, wipes down the gear. Rubs out fingerprints.He pinches the goggles through his rag, gently places them back onTimmy’s dead eyelids.He nods toward the door. I go first. Down the stairs. The camera’soff, silent. Logs probably wiped already. Evidence-wise, nobody’s come in,nobody’s gone out. Clean.Brian’s voice behind me.“Release the hounds,” he says to… someone.We exit and walk to my car. Before we drive off, two patrol cars race upto the building. We walk into Tom’s. Four-thirty AM, when the place empties out. We walk tothe cop booth – a woman I don’t know sits there in plain clothes. She seesBrian, he nods toward the door. This guy… The mystery woman tosses someeddies on the table, leaves. We sit down. Crystal is nowhere in sight. I spota half-empty coffee pot on the counter. God, I want that bitter brown liquidso bad, don’t care that it’s cold.I look around: there are three other diners, heads bowed, eyesaverted. And there’s Travis, alone at the drivers’ table, shooting me a dirtylook. Heh. Probably thinks I’m back in bed with the pigs.“Let’s talk…” Brian starts, then – “One sec.”He’s read my mind and walks to the counter. Pours coffee into two mugs,places one in front of me.“Assault rifles, huh?” I’m in no mood to dance around the point. Wants totalk? Let’s talk. “Fucking assault rifles.”“Frank, you stirred up a tsunami of horseshit. Shit I gotta take good timeoutta my night to wipe up. I was pretty clear not 48 hours ago: told you notto go digging. You forget how words work?”“You knew I wouldn’t listen. Wouldn’ta cooked up that fairy taleotherwise.”“You born yesterday? Fifteen years a badge, and I gotta spell it out thatwhen an old choom tells you to fuck off, that means fuck off? Only personyou should be pissy at right now is your own damn self.”Might be right. I sip my coffee. It goes down sandy – cinnamon sludge.Love coffee.“Here’s what we’ll do,” he says. “First, you tell me what you know. Second,I tell you where you’re wrong. Third, you get it through your thick, stubbornskull that you never speak a word to anybody. You’ll sleep easy for it. Deal?”“Why, Brian? You don’t owe me a thing.”“I remember you fondly.” Huh. I see it’s true. “The chick, right? It wasnever about her, Frank. You’ll see soon as I’m done telling you.”I hold exactly no cards. But that bad feeling’s back. And I’m starting toaccept my new reality – a constant, relentless bad feeling.“A clever 6th Street gun-nut’s passing merch left and right on thedown low,” I begin my tale. “Sometimes it’s smuggled, sometimes klepped,sometimes who the fuck knows where it’s from, but he has it. Couple weeksago, his sticky fingers pick up a real hot potato. Think we both know it wasn’tpop guns.”“It was not.”“What was it, Brian?”“We’ll get there. Go on.”“He senses the shit is too hot to handle. He has to pass it on, stat. Thedodge and shade’s too intense, though. Can’t just ping his fixer. He callsAguirre – a man with a crew and more cred than he knows how to wash.”“Always were a great detective, Frank.”“Fuck you, Brian.”“Go on.”Huh, I see it now. Feel it in my gut. Brian doesn’t have the whole story.One drop he just wasn’t able to squeeze out of people. Asked the wrongquestions.“Come on, go ahead” he taunts, “Then what?”“Ask me a question.”Silence. He nods.“Why was the girl there?”“She set up the meet. Aguirre wanted to leave the flag-wavers high anddry. His crew was divided. Half wanted the deal, half didn’t.”“Sorry, wait. A second-rate BD starlet from the screamsheets set up agang meet smack in the middle of an uncertain truce?” He shakes his head,genuinely surprised. “Fuck, what a story.”“You got no idea who she was.”“Shit. Someone oughta write a book about her.”That’s right, Brian. Someone should.“What comes next, Frank?”“They meet. Sixth Street realizes they aren’t talking to Aguirre, thingsget tense. They don’t want word to get out. Someone grabs their gun, firesa shot. Every last Valentino falls.”“And the merch?”“Still on 6th. Maybe. Haven’t gotten that far.”He stares at his coffee, looking for something at the bottom. He looksworried, wonders if he could’ve played it differently. Is he concerned? Couldjust be pretending, hoping I’ll place the last piece where it belongs. But thisone I don’t know how to solve.“Question is,” I resume, “where’s Jones? Isn’t that your job? Shouldn’tyou be out hunting him down, recovering that fiery merch?”He sips his coffee, glances around for eyes and ears. There’s nobodyleft, not even Travis. I didn’t see anyone walk out.“A few months ago, couple of guys from Supply and Facilities struck adeal with Jones. You know the NCPD, you know how thin a sliver you getas a beat cop. But every so often, Santa brings you a Militech, Arasaka orPetrochem package… Never enough to go around. And it always seems toland in the laps of top brass or the hands of those spec ops assclowns. Realgood shit, real good quality. Can make real good scratch pushing it out theside. Just need a guy like Jones on your comms.“NCPD’s selling hot-potato weaponry to gangers? Gangoons then turnthat shit back on cops?”“Even an old dog like you never woulda thunk it, huh?”He says “old dog,” but he doesn’t mean my loyal service as an NCPD officerin this fine city. He means I had my snout in the kibble like everybody else.I don’t answer.“A few weeks back, some braindead gonk marked the wrong package.Said package fell off the truck, you know the rest.”“‘Assault rifles’ – stands for what, Brian?”He looks me in the eye. Wonders if I can take the truth. When he openshis mouth, I know he’s being honest.“Combat processors for MaxTac.”“Fuckin’ hell.”“Exactly,” Brian says, “When Jones saw what he had, he startedshitting bricks.”“Couldn’t just return the package?”“Who to? Two days prior, Internal’d taken down his one good connect. Anunfortunate series of events.”I’m at a loss. He says nothing.“Know where the merch is?” I finally ask. “Sixth Street? With Jones?”He downs the rest of his coffee, sets his mug aside.“And thus we arrive at your one misstep, Frank. Jones died that night inCharter Hill.”I see it now. Unrelated events lining up, the dots connecting to forma lustrous green laser line. Brian at the crime scene. Ora’s hidden holo.Olivia’s tone when I asked about the shootout – “Little bro says hi”. Thatdrunk buffoon Zane who the cops didn’t waste five seconds on. Padre: “Theyasked the wrong questions.” Emilio, who would never hide out in some seedymotel if it was just about 6th Street. Timmy G. The “assault rifles.”It wasn’t the studio trying to bury this case alive.It was the police.“You wiped it clean.”“Internal started probing. I think you know that song and dance.”I do. Whole reason I left. After years of raking in hush money, thingsgot too hot for comfort. If Internal had connected those dots, I wouldn’t besitting here at Tom’s. I’d be sitting on Brooks Island. I know it, Brian knowsit… it’s why he hasn’t planted a dumdum between my eyes. Might also feellike he owes me, considering he filled the void I left behind. Brian Lee’ll neverleave. They’ll catch him or kill him, but he’ll never leave.“Sent the boys. They didn’t know the girl was gonna be there. If thingshad lined up right, we’d’ve taken care of biz with Jones and Aguirre. But,you know, spilled milk.”Spilled milk. Motherfucker.“Case like this, you can’t sit on your hands. Gotta fill all the cracks withconcrete fast. It’s why I forced Braddock to step aside, too… before spoutingword over half the city.”“Still went to Vista.”“We did, but we didn’t find much. Padre was faster, and he’s smart. If he’dfound out we were looking for more than evidence, he could’ve raised hell.”“I talked to him. Not a problem you need to see to.”“Aguirre?”There’s the question. My test. I tell the truth, the man meets his makerwithin a week. They’d track him down eventually. Emilio can’t brood at theHotel Triste forever. He shows his face on the street, not even Padre’ll beable to protect him. Emilio knows what Jones tried to sell him. Fuck me ifI’m gonna clue Brian in.“Not a problem either,” I lie. “Talked to him, has no idea what the fusswas about.”Brian raises a brow.“You sure?” he hesitates.“I’m sure.”The least I can do for her, the last I can do for her.“Well, we got the shit back. That’s what matters.” Brian offers his hand,claps me on the shoulder. “Sorry about your gangerchick.”Red. Blood red, the same red haze that shrouded everything the nightshe died.I shake it off.I stand. Leave my coffee.Brian stays seated, lights a smoke. He’s closed his case.I walk out. I drive. I drive in circles. Don’t wanna go home, don’t want the day toend. When it does, it’ll be a wrap on the Ora Dominguez case. Case. Jeez,talkin’ about her like a fuckin’ cop. Maybe that’s what it was. Maybe I justconducted my last investigation. Sans badge, sans shield, sans vest, butclean, following better rules than those I followed back in the day.Streets’re empty. Too early to go to work, too late to head home.A police siren. Shit. I realize it whines for me. Need to pull over. Wherethe hell am I? No people, no cars.In Night City, it’s the little things… I wasn’t thinking. Just drove out to themiddle of nowhere by the city line, never to be seen again. Shit. I might’vemade two missteps. Maybe Brian didn’t let me walk after all.Fuck it.I stop my car.Patrolman steps out of his.Little things. Same little shit who grabbed my number the night Ora Didied. He grins.Little things. He’s pullin’ me over for a broken taillight he’ll bash in himselfwith his zapwand.City code says I should stay in the car. If I don’t, he gets to use deadlyforce.I get out.The lightning snap and crack of a baton at full charge. Huh. If Brian’dsent him, he wouldn’t be fucking around with half-measures. It’s a completecoincidence. A blind, stupid, tragic accident.He swings the baton back like a baseball bat.He doesn’t see my fist. It smashes his nose. Doesn’t see my boot. It kickshis knee out. He doesn’t see a thing, he’s blind. He doesn’t see hit after hitafter hit as I drive him down into the wet earth. The baton falls from hishand. Ribs snap and crack like dry twigs.I don’t see him either. I see red. I see Brian, who they’ll kill or stuff in acage to rot. I see Cejas, a leper, a pariah among his blood brothers. I seeEmilio, his heart shattered into a million razors, never getting his revengeon Jones. I see Pedro – huh – his numbers finally lining up. Least I hope theywill.I don’t stop until the Sandevistan falls from my eyes, fades from my veins.Kid cop lies crumpled on the ground, barely breathing, bathed in blood.I breathe deep.I can barely stand.I feel no relief.","link":"/2021/01/10/en-a-short-story-of-cyberpunk2077-2am-she-calls/"},{"title":"Mood(Remix)歌词魔改","text":"Mood (Remix) 原作词 : Justin Bieber/Golden Landis Von Jones/Blake Slatkin/Omer Fedi/Keegan Bach/Michael Olmo/Jose Alvaro Osorio Balvin作曲 : Justin Bieber/Golden Landis Von Jones/Blake Slatkin/Omer Fedi/Keegan Bach/Michael Olmo/Jose Alvaro Osorio Balvin魔改+翻译：HackerRouter Why you always in a mood?你为何总是不开心呢，Fuckin ‘round, actin’ brand new,兜兜转转 又变了个新样子，I ain’t tryna tell you what to do, but try to play it cool,我不会告诉你该如何 只想冷静地说，Baby, I ain’t playing by your rules,亲，我不会被你的规则玩弄，Everything looks better with a view,看清全貌 也许会更好，Why you always in a mood?你为何总是不开心呢，Fuckin ‘round, actin’ brand new,兜兜转转 又变了个新样子，I ain’t tryna tell you what to do, but try to play it cool,我不会告诉你该如何 但只想冷静地说，Baby, I ain’t playing by your rules,亲，我不会被你的规则玩弄，Everything looks better with a view,看清全貌 也许会更好 You’ve been in a mood, you’ve been givin’ hella attitude,你一直不开心，表现得好像很有态度What I gotta do to finish with ya?我要怎么做你才愿意和我一起干活I could ever lose you,虽说我也有可能失去你Maybe spend a night out to do the job, like we used to,或许要熬夜干活 就像之前那样We could step back, find useful machines on YouTube,我们也可以跳出问题，在油管上找些有用的机器I know at times you can have let me down such kind,我知道，有的时候你就仁慈地让我失望I’m tryna control your life making u be online,我真想试着控制你的生活，让你上线干活You know what I mean, you know what I need,你知道我什么意思，你知道我想要什么 We play games of blocks to avoid depression,我们打着MC 抵抗自己的抑郁，We’ve been here before and l won’t be your victim,我们曾将其经历 我不会再心甘情愿因你受伤， Why you always in a mood?你为何总是不开心呢，Fuckin ‘round, actin’ brand new,兜兜转转 又变了个新样子，I ain’t tryna tell you what to do, but try to play it cool,我不会告诉你该如何 只想冷静地说，Baby, I ain’t playing by your rules,亲，我不会被你的规则玩弄，Everything looks better with a view,看清全貌 也许会更好，Why you always in a mood?你为何总是不开心呢，Fuckin ‘round, actin’ brand new,兜兜转转 又变了个新样子，I ain’t tryna tell you what to do, but try to play it cool,我不会告诉你该如何 但只想冷静地说，Baby, I ain’t playing by your rules,亲，我不会被你的规则玩弄，Everything looks better with a view,看清全貌 也许会更好 Yeah, I never got money, I know you’re goin’ crazy,对，我没钱，晓得你们开始疯狂Number one sever in the world, I mean at the bottom of the list,我服就是世界第一，我是指倒数Where you’re from, people like you don’t make it with my team,像你们这样的人从来就不和其他人干活What’s with the attitude, baby?你耍什么脾气呢，亲Tell me why you hating,为什么就你不开心呢We fuss and fight, you get into moods,我们争吵不停，你又开始生气Argue all day, what we supposed to do?整天争吵，我们该怎么做Can’t make things right, so I’m on the move,问题解决不了，那我就找其他人做Guess you will approve,想必你肯定很赞成 We play games of blocks to avoid depression,我们打着MC 抵抗自己的抑郁，We’ve been here before and l won’t be your victim,我们曾将其经历 我不会再心甘情愿因你受伤， Why you always in a mood?你为何总是不开心呢，Fuckin ‘round, actin’ brand new,兜兜转转 又变了个新样子，I ain’t tryna tell you what to do, but try to play it cool,我不会告诉你该如何 只想冷静地说，Baby, I ain’t playing by your rules,亲，我不会被你的规则玩弄，Everything looks better with a view,看清全貌 也许会更好，Why you always in a mood?你为何总是不开心呢，Fuckin ‘round, actin’ brand new,兜兜转转 又变了个新样子，I ain’t tryna tell you what to do, but try to play it cool,我不会告诉你该如何 但只想冷静地说，Baby, I ain’t playing by your rules,亲，我不会被你的规则玩弄，Everything looks better with a view,看清全貌 也许会更好 Overwatch yes, man Baby, doing a project like a dove, ya-ya, yeah,亲，你肝工程时全程咕咕Complain ya all the time when the server shut,却还在服务器关时一个劲抱怨It’s not logical,这不符逻辑Leaving BCP is better than that我离开BCP都比忍受这些强Stop sitting out and driving in the backseat别在肝工程时袖手旁观还指指点点Hold on, you guys never care about me,等下，你们这些家伙从来都不关心我Guess it’s time to kick a man who is doing nothing,我想是时候踢些什么都不干的人了Go away, this is not the way,爬吧，在我服干事可不能像这样I shouldn’t invite you, mayday就不该邀请你的，救命I’m still caring about my study, mayday,我仍然得顾着学业，救命When you guys get your jobs in may当你们早早就有了工作不用担心时 Why you always in a mood?你为何总是不开心呢，Fuckin ‘round, actin’ brand new,兜兜转转 又变了个新样子，I ain’t tryna tell you what to do, but try to play it cool,我不会告诉你该如何 只想冷静地说，Baby, I ain’t playing by your rules,亲，我不会被你的规则玩弄，Everything looks better with a view,看清全貌 也许会更好，Why you always in a mood?你为何总是不开心呢，Fuckin ‘round, actin’ brand new,兜兜转转 又变了个新样子，I ain’t tryna tell you what to do, but try to play it cool,我不会告诉你该如何 但只想冷静地说，Baby, I ain’t playing by your rules,亲，我不会被你的规则玩弄，Everything looks better with a view,看清全貌 也许会更好","link":"/2021/07/11/mood-remix-lyric/"},{"title":"Monsters歌词魔改","text":"MonstersTimeflies / Katie Sky 魔改+翻译：HackerRouter I see your monsters,我看见你内心的野兽，I see your pain,我看见你的痛苦，Tell me your problems,告诉我你的苦恼，I’ll chase them away,我会把它们统统赶走，I’ll be your lighthouse,我会是你的灯塔，I’ll make it okay,让一切都好起来，When I see your monsters,当我看见你内心的野兽，I’ll stand there so brave,我会勇敢面对它们，And chase them all away,把他们统统赶走， I don”t know what I’m fucking hating,我真不知道我他妈在讨厌什么，But there’s a sound around my ear all night,但是整夜都有一个声音萦绕耳畔，I’m awake but still sleeping,我虽然清醒 但依然沉睡，I keep telling myself I’ll be alright (I won’t),我不断对自己说 我会好好的（但我做不到），This is just like a physiological reaction I tell myself,这只是些生理反应我继续对自己说，I’m still crying I guess I wouldn’t be well,但我仍在哭泣我感觉我不会好转，Gosh how can I stop this I don’t know-how,老天，怎么停止这样，我不知道，I feel so alone and I final drop out,当我放弃停下时，我只觉得孤独，Please give me a shot,给我来一枪吧，So there won’t be more teardrops,这样就不会有更多的眼泪，Smile and laugh like I used to,我依然微笑，I’ve been in denial since it happened,尽管这已发生，我依然矢口否认，Just take me to the past,把我带回过去吧，Cuz I wanna end my life,我只想结束我的人生，I can’t explain this so I’ll keep it all inside,我没法解释 只好深埋于心，Wear my pain, but it’s masked by my pride,我的骄傲之下，隐藏着我的痛苦，No one could understand me I said,我说，没人能理解我，Don’t need anyone why do you say,不需要任何人，等下你为什么说—— I see your monsters,我看见你内心的野兽，I see your pain,我看见你的痛苦，Tell me your problems,告诉我你的苦恼，I’ll chase them away,我会把它们统统赶走，I’ll be your lighthouse,我会是你的灯塔，I’ll make it okay,让一切都好起来，When I see your monsters,当我看见你内心的野兽，I’ll stand there so brave,我会勇敢面对它们，And chase them all away,把他们统统赶走， I can’t,我无法做到，You won’t like what you see,你不会喜欢你所看到的，If you were in my head and had to hear my pleas,如果你在我脑中，听到我的祈求，It’s like,就像是，I can’t believe this is happening to me,我无法相信发生在我身上的一切，And could someone please give me a knife I’m afraid of facing来个人给我把刀吧我害怕面对，My life always gives me pain,我的生活只会给我痛苦，And I never get gain,我永远不会有所收获，I’m gonna kill everything,我要去干了一切，Including me and those moving things,包括我和那些生物（moving things可理解为mobs），I hate the law it won’t let me hurt other people,我恨法律，它使我无法杀人，But believe me,但相信我，I still can slit my wrist, leaving the world我还是可以办掉自己，离开世界，No no this is not MDD I’m not psycho,不不这不是抑郁症我没有精神失常，I don’t need pills I don’t wanna be locked in,我不需要药我不想被关起来，I don’t wanna be discriminated plz求你了，我不想被歧视，Trust me I don’t need any counselling,相信我我不需要心理咨询，Knowing I’ll die one day not accidentally,知道我总会非意外死亡，Come on I’m half deceased,呵呵我早就要入土为安了，This is not an illness I won’t die happily,这真的不是病但我不会九泉含笑，A blank stare as I stand so alone,我孤零零站在这里，眼神空洞，And know the old me had gone (damn),知道过去的我永远不会再回来了， I see your monsters,我看到你内心的野兽，I see your pain,我看见你的痛苦，Tell me your problems,告诉我你的苦恼，I’ll chase them away,我把他们统统赶走，I’ll be your lighthouse,我会是你的灯塔，I’ll make it okay,让一切都好起来，When I see your monsters,当我看见你内心的野兽，I’ll stand there so brave,我会勇敢面对它们，And chase them all away,把他们统统赶走， I should jump at another place I’m disappointed,我太失望了我真该找另外一个地方跳的，Now I feel such shame,让我感觉如此可惜，I don’t even know his name,我不知道那个人的名字，He strikes me hard like playing a game,但他一直像玩游戏般打击我，Felt like I was on those,感觉我想留下，But keep slipping away,但却一直逃离，I want nobody else,我不需要别人，But it’s hard to get to know me,但很难有人理解我，When I don’t know myself,当我也不了解我自己时，And he helps,他帮助我，Keeping instigating,怂恿着，Let me end everything,让我了结一切，Then you looked at me now,现在你看着我，And said,说， I see your monsters,我看到你内心的野兽，I see your pain,我看见你的痛苦，Tell me your problems,告诉我你的苦恼，I’ll chase them away,我把他们统统赶走，I’ll be your lighthouse,我会是你的灯塔，I’ll make it okay,让一切都好起来，When I see your monsters,当我看见你内心的野兽，I’ll stand there so brave,我会勇敢面对它们，I see your monsters,我看见你内心的野兽，I see your pain,我看见你的痛苦，Tell me your problems,告诉我你的苦恼，I’ll chase them away,我把他们统统赶走，I’ll be your lighthouse,我会是你的灯塔，I’ll make it okay,让一切都好起来，When I see your monsters,当我看见你内心的野兽，I’ll stand there so brave,我会勇敢面对它们，And chase them all away,把他们统统赶走。","link":"/2021/07/24/monsters-remix-lyric/"},{"title":"Sparks Fly歌词魔改","text":"Sparks fly 作词 : Taylor Swift，作曲 : Taylor Swift，魔改+翻译：HackerRouter The way you move is like full of rainstorm,你的一举一动都充斥着暴风雨，And I’m a house of cards,而我就像纸牌搭起的房子脆弱，You’re the kinda ruthless that should send me running,你有点无情至极，我应该远离，But I kinda know that I won’t get far,但我深知我办不到，And you stood there in front of me just,你站在我面前，Close enough to touch,近得触手可及，Close enough to hope you couldn’t see,希望你没有察觉，What I was thinking of,我正在想什么， Drop everything out,放弃一切，Leave me in the pouring rain,将我留在倾盆大雨中，Slit me on the sidewalk,在街边让我zs，Take me the pain,带来所有的痛楚，‘Cause I see sparks fly and I never knew you smile,因为我看见，烟花飞舞般灿烂，然而我从未见过你笑Afflict with those green eyes, baby,亲，就和那些嫉妒的眼神一起折磨我吧，As the lights go down,就好像灯光都黯然失色，Give me something that’ll hurt me when you’re not around,当你不在身边时，给我点东西伤害我，‘Cause I see sparks fly and I never knew you smile,因为我看见，烟花飞舞般灿烂，然而我从未见过你笑 My mind forgets to remind me,理智忘了提醒自己，You’re a bad ideal,你并不完美，You harm me once and it’s,当你第一次伤害我，Really something,我能感觉到，美妙的事情即将上演，You find I’m even worse than you imagined I would be,你会发现我比你想象中的还要糟，I’m on my guard for the rest of the world,我对外界保持着戒心，And with you I know it is good,与你在一起，就更加防备，And I could wait patiently but,我可以耐心等待，I really wish you could,但是我真的希望你能， Drop everything out,放弃一切，Leave me in the pouring rain,将我留在倾盆大雨中，Slit me on the sidewalk,在街边让我zs，Take me the pain,带来所有的痛楚，‘Cause I see sparks fly and I never knew you smile,因为我看见，烟花飞舞般灿烂，然而我从未见过你笑Afflict with those green eyes, baby,亲，就和那些嫉妒的眼神一起折磨我吧，As the lights go down,就好像灯光都黯然失色，Give me something that’ll hurt me when you’re not around,当你不在身边时，给我点东西伤害我，‘Cause I see sparks fly and I never knew you smile,因为我看见，烟花飞舞般灿烂，然而我从未见过你笑 I run my fingers through your hair,指间划过你的发丝，And watch the lights go wild,凝望着灯火熄灭，Just keep on keepin’ your bias on me,就让你对我怀有偏见，It’s just wrong enough to make it feel right,那足矣让我感到满足，And give me up then tease,宣告我无药可救再嘲笑一番，Won’t you whisper roar and slow,会在我耳边不慌不忙地咆哮么？I’m escalating by you, baby,我的行为彻底被你加剧，Like a firework show,如同一场烟花秀， Drop everything out,放弃一切，Leave me in the pouring rain,将我留在倾盆大雨中，Slit me on the sidewalk,在街边让我zs，Take me the pain,带来所有的痛楚，‘Cause I see sparks fly and I never knew you smile,因为我看见，烟花飞舞般灿烂，然而我从未见过你笑Afflict with those green eyes, baby,亲，就和那些嫉妒的眼神一起折磨我吧，As the lights go down,就好像灯光都黯然失色，Give me something that’ll hurt me when you’re not around,当你不在身边时，给我点东西伤害我，‘Cause I see sparks fly and I never knew you smile,因为我看见，烟花飞舞般灿烂，然而我从未见过你笑And the sparks fly,火花飞舞，Oh baby while…哦 亲 当…And the sparks fly,火花飞舞","link":"/2021/07/24/sparks-fly-remix-lyric/"}],"tags":[{"name":"＃教程＃","slug":"＃教程＃","link":"/tags/%EF%BC%83%E6%95%99%E7%A8%8B%EF%BC%83/"},{"name":"＃杂谈＃","slug":"＃杂谈＃","link":"/tags/%EF%BC%83%E6%9D%82%E8%B0%88%EF%BC%83/"},{"name":"＃Minecraft＃","slug":"＃Minecraft＃","link":"/tags/%EF%BC%83Minecraft%EF%BC%83/"},{"name":"＃其他＃","slug":"＃其他＃","link":"/tags/%EF%BC%83%E5%85%B6%E4%BB%96%EF%BC%83/"},{"name":"＃小说＃","slug":"＃小说＃","link":"/tags/%EF%BC%83%E5%B0%8F%E8%AF%B4%EF%BC%83/"},{"name":"＃歌曲＃","slug":"＃歌曲＃","link":"/tags/%EF%BC%83%E6%AD%8C%E6%9B%B2%EF%BC%83/"}],"categories":[{"name":"＃日常","slug":"＃日常","link":"/categories/%EF%BC%83%E6%97%A5%E5%B8%B8/"},{"name":"＃赛博朋克2077","slug":"＃赛博朋克2077","link":"/categories/%EF%BC%83%E8%B5%9B%E5%8D%9A%E6%9C%8B%E5%85%8B2077/"},{"name":"＃Minecraft","slug":"＃Minecraft","link":"/categories/%EF%BC%83Minecraft/"}]}